zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc_ex.h
  uint32_t SpdifrxClockSelection;  /*!< Specifies SPDIFRX Clock clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SPDIFRX_Clock_Source */

  uint32_t Adc1ClockSelection;     /*!< Specifies ADC1 interface clock source
                                        This parameter can be a value of @ref
                                        RCCEx_ADC1_Clock_Source */

  uint32_t Adc2ClockSelection;     /*!< Specifies ADC2 interface clock source
                                        This parameter can be a value of @ref
                                        RCCEx_ADC2_Clock_Source */

  uint32_t Sdmmc1ClockSelection;   /*!< Specifies SDMMC1 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SDMMC1_Clock_Source */

  uint32_t Sdmmc2ClockSelection;   /*!< Specifies SDMMC2 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SDMMC2_Clock_Source */

  uint32_t Eth1ClockSelection;     /*!< Specifies ETH1 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_ETH1_Clock_Source */

  uint32_t Eth2ClockSelection;     /*!< Specifies ETH1 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_ETH1_Clock_Source */

  uint32_t UsbphyClockSelection;   /*!< Specifies USB PHY clock source
                                        This parameter can be a value of @ref
                                        RCCEx_USBPHY_Clock_Source */

  uint32_t UsboClockSelection;     /*!< Specifies USB OTG clock source
                                        This parameter can be a value of @ref
                                        RCCEx_USBO_Clock_Source */

  uint32_t QspiClockSelection;     /*!< Specifies QSPI clock source
                                        This parameter can be a value of @ref
                                        RCCEx_QSPI_Clock_Source */

  uint32_t FmcClockSelection;      /*!< Specifies FMC clock source
                                        This parameter can be a value of @ref
                                        RCCEx_FMC_Clock_Source */

  uint32_t Rng1ClockSelection;     /*!< Specifies RNG1 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_RNG1_Clock_Source */

  uint32_t StgenClockSelection;    /*!< Specifies STGEN clock source
                                        This parameter can be a value of @ref
                                        RCCEx_STGEN_Clock_Source */

  uint32_t DcmippClockSelection;   /*!< Specifies DCMIPP clock source
                                        This parameter can be a value of @ref
                                        RCCEx_DCMIPP_Clock_Source */

  uint32_t SaesClockSelection;     /*!< Specifies SAES clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SAES_Clock_Source */

  uint32_t TIMG1PresSelection;     /*!< Specifies TIM Group 1 Clock Prescalers
                                        Selection.
                                        This parameter can be a value of @ref
                                        RCCEx_TIMG1_Prescaler_Selection */

  uint32_t TIMG2PresSelection;     /*!< Specifies TIM Group 2 Clock Prescalers
                                        Selection.
                                        This parameter can be a value of @ref
                                        RCCEx_TIMG2_Prescaler_Selection */

  uint32_t TIMG3PresSelection;     /*!< Specifies TIM Group 3 Clock Prescalers
                                        Selection.
                                        This parameter can be a value of @ref
                                        RCCEx_TIMG3_Prescaler_Selection */

  uint32_t RTCClockSelection;      /*!< Specifies RTC clock source
                                        This parameter can be a value of @ref
                                        RCC_RTC_Clock_Source */

  uint32_t CkperClockSelection;    /*!< Specifies CKPER clock source
                                        This parameter can be a value of @ref
                                        RCCEx_CKPER_Clock_Source */

} RCC_PeriphCLKInitTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */

/** @defgroup RCCEx_Periph_Clock_Selection RCCEx_Periph_Clock_Selection
  * @{
  */
#define RCC_PERIPHCLK_I2C12             ((uint64_t)0x00000001U)
#define RCC_PERIPHCLK_I2C3              ((uint64_t)0x00000002U)
#define RCC_PERIPHCLK_I2C4              ((uint64_t)0x00000004U)
#define RCC_PERIPHCLK_I2C5              ((uint64_t)0x00000008U)
#define RCC_PERIPHCLK_SPI1              ((uint64_t)0x00000010U)
#define RCC_PERIPHCLK_SPI23             ((uint64_t)0x00000020U)
#define RCC_PERIPHCLK_SPI4              ((uint64_t)0x00000040U)
#define RCC_PERIPHCLK_SPI5              ((uint64_t)0x00000080U)
#define RCC_PERIPHCLK_USART1            ((uint64_t)0x00000100U)
#define RCC_PERIPHCLK_USART2            ((uint64_t)0x00000200U)
#define RCC_PERIPHCLK_UART35            ((uint64_t)0x00000400U)
#define RCC_PERIPHCLK_UART4             ((uint64_t)0x00000800U)
#define RCC_PERIPHCLK_USART6            ((uint64_t)0x00001000U)
#define RCC_PERIPHCLK_UART78            ((uint64_t)0x00002000U)
#define RCC_PERIPHCLK_LPTIM1            ((uint64_t)0x00004000U)
#define RCC_PERIPHCLK_LPTIM2            ((uint64_t)0x00008000U)
#define RCC_PERIPHCLK_LPTIM3            ((uint64_t)0x00010000U)
#define RCC_PERIPHCLK_LPTIM45           ((uint64_t)0x00020000U)
#define RCC_PERIPHCLK_SAI1              ((uint64_t)0x00040000U)
#define RCC_PERIPHCLK_SAI2              ((uint64_t)0x00080000U)
#define RCC_PERIPHCLK_FDCAN             ((uint64_t)0x00100000U)
#define RCC_PERIPHCLK_SPDIFRX           ((uint64_t)0x00200000U)
#define RCC_PERIPHCLK_ADC1              ((uint64_t)0x00400000U)
#define RCC_PERIPHCLK_ADC2              ((uint64_t)0x00800000U)
#define RCC_PERIPHCLK_SDMMC1            ((uint64_t)0x01000000U)
#define RCC_PERIPHCLK_SDMMC2            ((uint64_t)0x02000000U)
#define RCC_PERIPHCLK_ETH1              ((uint64_t)0x04000000U)
#define RCC_PERIPHCLK_ETH2              ((uint64_t)0x08000000U)
#define RCC_PERIPHCLK_USBPHY            ((uint64_t)0x10000000U)
#define RCC_PERIPHCLK_USBO              ((uint64_t)0x20080000U)
#define RCC_PERIPHCLK_QSPI              ((uint64_t)0x40000000U)
#define RCC_PERIPHCLK_FMC               ((uint64_t)0x80000000U)
#define RCC_PERIPHCLK_RNG1              ((uint64_t)0x100000000U)
#define RCC_PERIPHCLK_STGEN             ((uint64_t)0x200000000U)
#define RCC_PERIPHCLK_DCMIPP            ((uint64_t)0x400000000U)
#define RCC_PERIPHCLK_SAES              ((uint64_t)0x800000000U)
#define RCC_PERIPHCLK_TIMG1             ((uint64_t)0x1000000000U)
#define RCC_PERIPHCLK_TIMG2             ((uint64_t)0x2000000000U)
#define RCC_PERIPHCLK_TIMG3             ((uint64_t)0x4000000000U)
#define RCC_PERIPHCLK_RTC               ((uint64_t)0x8000000000U)
#define RCC_PERIPHCLK_CKPER             ((uint64_t)0x10000000000U)

#define IS_RCC_PERIPHCLOCK(SELECTION) \
  ((((SELECTION) & RCC_PERIPHCLK_I2C12)  == RCC_PERIPHCLK_I2C12)  || \
   (((SELECTION) & RCC_PERIPHCLK_I2C3)   == RCC_PERIPHCLK_I2C3)   || \
   (((SELECTION) & RCC_PERIPHCLK_I2C4)   == RCC_PERIPHCLK_I2C4)   || \
   (((SELECTION) & RCC_PERIPHCLK_I2C5)   == RCC_PERIPHCLK_I2C5)   || \
   (((SELECTION) & RCC_PERIPHCLK_SPI1)   == RCC_PERIPHCLK_SPI1)   || \
   (((SELECTION) & RCC_PERIPHCLK_SPI23)  == RCC_PERIPHCLK_SPI23)  || \
   (((SELECTION) & RCC_PERIPHCLK_SPI4)   == RCC_PERIPHCLK_SPI4)   || \
   (((SELECTION) & RCC_PERIPHCLK_SPI5)   == RCC_PERIPHCLK_SPI5)   || \
   (((SELECTION) & RCC_PERIPHCLK_USART1) == RCC_PERIPHCLK_USART1) || \
   (((SELECTION) & RCC_PERIPHCLK_USART2) == RCC_PERIPHCLK_USART2) || \
   (((SELECTION) & RCC_PERIPHCLK_UART35) == RCC_PERIPHCLK_UART35) || \
   (((SELECTION) & RCC_PERIPHCLK_UART4)  == RCC_PERIPHCLK_UART4)  || \
   (((SELECTION) & RCC_PERIPHCLK_USART6) == RCC_PERIPHCLK_USART6) || \
   (((SELECTION) & RCC_PERIPHCLK_UART78) == RCC_PERIPHCLK_UART78) || \
   (((SELECTION) & RCC_PERIPHCLK_LPTIM1) == RCC_PERIPHCLK_LPTIM1) || \
   (((SELECTION) & RCC_PERIPHCLK_LPTIM2) == RCC_PERIPHCLK_LPTIM2) || \
   (((SELECTION) & RCC_PERIPHCLK_LPTIM3) == RCC_PERIPHCLK_LPTIM3) || \
   (((SELECTION) & RCC_PERIPHCLK_LPTIM45)== RCC_PERIPHCLK_LPTIM45)|| \
   (((SELECTION) & RCC_PERIPHCLK_SAI1)   == RCC_PERIPHCLK_SAI1)   || \
   (((SELECTION) & RCC_PERIPHCLK_SAI2)   == RCC_PERIPHCLK_SAI2)   || \
   (((SELECTION) & RCC_PERIPHCLK_FDCAN)  == RCC_PERIPHCLK_FDCAN)  || \
   (((SELECTION) & RCC_PERIPHCLK_SPDIFRX)== RCC_PERIPHCLK_SPDIFRX)|| \
   (((SELECTION) & RCC_PERIPHCLK_ADC1)   == RCC_PERIPHCLK_ADC1)   || \
   (((SELECTION) & RCC_PERIPHCLK_ADC2)   == RCC_PERIPHCLK_ADC2)   || \
   (((SELECTION) & RCC_PERIPHCLK_SDMMC1) == RCC_PERIPHCLK_SDMMC1) || \
   (((SELECTION) & RCC_PERIPHCLK_SDMMC2) == RCC_PERIPHCLK_SDMMC2) || \
   (((SELECTION) & RCC_PERIPHCLK_ETH1)   == RCC_PERIPHCLK_ETH1)   || \
   (((SELECTION) & RCC_PERIPHCLK_ETH2)   == RCC_PERIPHCLK_ETH2)   || \
   (((SELECTION) & RCC_PERIPHCLK_USBPHY) == RCC_PERIPHCLK_USBPHY) || \
   (((SELECTION) & RCC_PERIPHCLK_USBO)   == RCC_PERIPHCLK_USBO)   || \
   (((SELECTION) & RCC_PERIPHCLK_QSPI)   == RCC_PERIPHCLK_QSPI)   || \
   (((SELECTION) & RCC_PERIPHCLK_FMC)    == RCC_PERIPHCLK_FMC)    || \
   (((SELECTION) & RCC_PERIPHCLK_RNG1)   == RCC_PERIPHCLK_RNG1)   || \
   (((SELECTION) & RCC_PERIPHCLK_STGEN)  == RCC_PERIPHCLK_STGEN)  || \
   (((SELECTION) & RCC_PERIPHCLK_DCMIPP) == RCC_PERIPHCLK_DCMIPP) || \
   (((SELECTION) & RCC_PERIPHCLK_SAES)   == RCC_PERIPHCLK_SAES)   || \
   (((SELECTION) & RCC_PERIPHCLK_TIMG1)  == RCC_PERIPHCLK_TIMG1)  || \
   (((SELECTION) & RCC_PERIPHCLK_TIMG2)  == RCC_PERIPHCLK_TIMG2)  || \
   (((SELECTION) & RCC_PERIPHCLK_TIMG3)  == RCC_PERIPHCLK_TIMG3)  || \
   (((SELECTION) & RCC_PERIPHCLK_RTC)    == RCC_PERIPHCLK_RTC)    || \
   (((SELECTION) & RCC_PERIPHCLK_CKPER)  == RCC_PERIPHCLK_CKPER))

/**
  * @}
  */

/** @defgroup RCCEx_Periph_One_Clock RCCEx_Periph_One_Clock
  * @{
  */
#define RCC_PERIPHCLK_LTDC              ((uint64_t)0x100000000000U)
#define RCC_PERIPHCLK_DFSDM1            ((uint64_t)0x200000000000U)
#define RCC_PERIPHCLK_DTS               ((uint64_t)0x400000000000U)
#define RCC_PERIPHCLK_IWDG1             ((uint64_t)0x800000000000U)
#define RCC_PERIPHCLK_DDRPHYC           ((uint64_t)0x1000000000000U)
#define RCC_PERIPHCLK_IWDG2             ((uint64_t)0x2000000000000U)
#define RCC_PERIPHCLK_TIM2              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM3              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM4              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM5              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM6              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM7              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM12             RCC_PERIPHCLK_TIMG3
#define RCC_PERIPHCLK_TIM13             RCC_PERIPHCLK_TIMG3
#define RCC_PERIPHCLK_TIM14             RCC_PERIPHCLK_TIMG3
#define RCC_PERIPHCLK_TIM1              RCC_PERIPHCLK_TIMG2
#define RCC_PERIPHCLK_TIM8              RCC_PERIPHCLK_TIMG2
#define RCC_PERIPHCLK_TIM15             RCC_PERIPHCLK_TIMG3
#define RCC_PERIPHCLK_TIM16             RCC_PERIPHCLK_TIMG3
#define RCC_PERIPHCLK_TIM17             RCC_PERIPHCLK_TIMG3

#define IS_RCC_PERIPHONECLOCK(PERIPH) \
  ((((PERIPH) & RCC_PERIPHCLK_LTDC)     == RCC_PERIPHCLK_LTDC)    || \
   (((PERIPH) & RCC_PERIPHCLK_DFSDM1)   == RCC_PERIPHCLK_DFSDM1)  || \
   (((PERIPH) & RCC_PERIPHCLK_DTS)      == RCC_PERIPHCLK_DTS)     || \
   (((PERIPH) & RCC_PERIPHCLK_IWDG1)    == RCC_PERIPHCLK_IWDG1)   || \
   (((PERIPH) & RCC_PERIPHCLK_IWDG2)    == RCC_PERIPHCLK_IWDG2)   || \
   (((PERIPH) & RCC_PERIPHCLK_DDRPHYC)  == RCC_PERIPHCLK_DDRPHYC) || \
   (((PERIPH) & RCC_PERIPHCLK_TIMG1)    == RCC_PERIPHCLK_TIMG1)   || \
   (((PERIPH) & RCC_PERIPHCLK_TIMG2)    == RCC_PERIPHCLK_TIMG2)   || \
   (((PERIPH) & RCC_PERIPHCLK_TIMG3)    == RCC_PERIPHCLK_TIMG3))

/**
  * @}
  */

/** @defgroup RCCEx_I2C12_Clock_Source  I2C12 Clock Source
  * @{
  */
#define RCC_I2C12CLKSOURCE_PCLK1        0U
#define RCC_I2C12CLKSOURCE_PLL4         RCC_I2C12CKSELR_I2C12SRC_0
#define RCC_I2C12CLKSOURCE_HSI          RCC_I2C12CKSELR_I2C12SRC_1
#define RCC_I2C12CLKSOURCE_CSI          (RCC_I2C12CKSELR_I2C12SRC_1 | RCC_I2C12CKSELR_I2C12SRC_0)

#define IS_RCC_I2C12CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_I2C12CLKSOURCE_PCLK1)  || \
   ((SOURCE) == RCC_I2C12CLKSOURCE_PLL4)   || \
   ((SOURCE) == RCC_I2C12CLKSOURCE_HSI)    || \
   ((SOURCE) == RCC_I2C12CLKSOURCE_CSI))
/**
  * @}
  */

/** @defgroup RCCEx_I2C3_Clock_Source I2C3 Clock Source
  * @{
  */
#define RCC_I2C3CLKSOURCE_PCLK6         0U
#define RCC_I2C3CLKSOURCE_PLL4          RCC_I2C345CKSELR_I2C3SRC_0
#define RCC_I2C3CLKSOURCE_HSI           RCC_I2C345CKSELR_I2C3SRC_1
#define RCC_I2C3CLKSOURCE_CSI           (RCC_I2C345CKSELR_I2C3SRC_1 | RCC_I2C345CKSELR_I2C3SRC_0)

#define IS_RCC_I2C3CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_I2C3CLKSOURCE_PCLK6)  || \
   ((SOURCE) == RCC_I2C3CLKSOURCE_PLL4)   || \
   ((SOURCE) == RCC_I2C3CLKSOURCE_HSI)    || \
   ((SOURCE) == RCC_I2C3CLKSOURCE_CSI))
/**
  * @}
  */

/** @defgroup RCCEx_I2C4_Clock_Source I2C4 Clock Source
  * @{
  */
#define RCC_I2C4CLKSOURCE_PCLK6         0U
#define RCC_I2C4CLKSOURCE_PLL4          RCC_I2C345CKSELR_I2C4SRC_0
#define RCC_I2C4CLKSOURCE_HSI           RCC_I2C345CKSELR_I2C4SRC_1
#define RCC_I2C4CLKSOURCE_CSI           (RCC_I2C345CKSELR_I2C4SRC_1 | RCC_I2C345CKSELR_I2C4SRC_0)

