zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc_ex.h
#define IS_RCC_I2C4CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_I2C4CLKSOURCE_PCLK6)  || \
   ((SOURCE) == RCC_I2C4CLKSOURCE_PLL4)   || \
   ((SOURCE) == RCC_I2C4CLKSOURCE_HSI)    || \
   ((SOURCE) == RCC_I2C4CLKSOURCE_CSI))
/**
  * @}
  */

/** @defgroup RCCEx_I2C5_Clock_Source I2C5 Clock Source
  * @{
  */
#define RCC_I2C5CLKSOURCE_PCLK6         0U
#define RCC_I2C5CLKSOURCE_PLL4          RCC_I2C345CKSELR_I2C5SRC_0
#define RCC_I2C5CLKSOURCE_HSI           RCC_I2C345CKSELR_I2C5SRC_1
#define RCC_I2C5CLKSOURCE_CSI           (RCC_I2C345CKSELR_I2C5SRC_1 | RCC_I2C345CKSELR_I2C5SRC_0)

#define IS_RCC_I2C5CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_I2C5CLKSOURCE_PCLK6)  || \
   ((SOURCE) == RCC_I2C5CLKSOURCE_PLL4)   || \
   ((SOURCE) == RCC_I2C5CLKSOURCE_HSI)    || \
   ((SOURCE) == RCC_I2C5CLKSOURCE_CSI))
/**
  * @}
  */

/** @defgroup RCCEx_SAI1_Clock_Source SAI1 Clock Source
  * @{
  */
#define RCC_SAI1CLKSOURCE_PLL4         0U
#define RCC_SAI1CLKSOURCE_PLL3_Q       RCC_SAI1CKSELR_SAI1SRC_0
#define RCC_SAI1CLKSOURCE_I2SCKIN      RCC_SAI1CKSELR_SAI1SRC_1
#define RCC_SAI1CLKSOURCE_PER          (RCC_SAI1CKSELR_SAI1SRC_1 | RCC_SAI1CKSELR_SAI1SRC_0)
#define RCC_SAI1CLKSOURCE_PLL3_R       RCC_SAI1CKSELR_SAI1SRC_2

#define IS_RCC_SAI1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SAI1CLKSOURCE_PLL4)    || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_PLL3_Q)   || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_I2SCKIN)  || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_PER)      || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_PLL3_R))
/**
  * @}
  */


/** @defgroup RCCEx_SAI2_Clock_Source SAI2 Clock Source
  * @{
  */
#define RCC_SAI2CLKSOURCE_PLL4          0U
#define RCC_SAI2CLKSOURCE_PLL3_Q        RCC_SAI2CKSELR_SAI2SRC_0
#define RCC_SAI2CLKSOURCE_I2SCKIN       RCC_SAI2CKSELR_SAI2SRC_1
#define RCC_SAI2CLKSOURCE_PER           (RCC_SAI2CKSELR_SAI2SRC_1 | RCC_SAI2CKSELR_SAI2SRC_0)
#define RCC_SAI2CLKSOURCE_SPDIF         RCC_SAI2CKSELR_SAI2SRC_2
#define RCC_SAI2CLKSOURCE_PLL3_R        (RCC_SAI2CKSELR_SAI2SRC_2 | RCC_SAI2CKSELR_SAI2SRC_0)


#define IS_RCC_SAI2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SAI2CLKSOURCE_PLL4)    || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_PLL3_Q)  || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_I2SCKIN) || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_PER)     || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_SPDIF)   || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_PLL3_R))
/**
  * @}
  */


/** @defgroup RCCEx_SPI1_Clock_Source SPI/I2S1 Clock Source
  * @{
  */
#define RCC_SPI1CLKSOURCE_PLL4        0U
#define RCC_SPI1CLKSOURCE_PLL3_Q      RCC_SPI2S1CKSELR_SPI1SRC_0
#define RCC_SPI1CLKSOURCE_I2SCKIN     RCC_SPI2S1CKSELR_SPI1SRC_1
#define RCC_SPI1CLKSOURCE_PER         (RCC_SPI2S1CKSELR_SPI1SRC_1 | RCC_SPI2S1CKSELR_SPI1SRC_0)
#define RCC_SPI1CLKSOURCE_PLL3_R      RCC_SPI2S1CKSELR_SPI1SRC_2

#define IS_RCC_SPI1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI1CLKSOURCE_PLL4)    || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_PLL3_Q)  || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_I2SCKIN) || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_PER)     || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_PLL3_R))
/**
  * @}
  */

/** @defgroup RCCEx_SPI23_Clock_Source SPI/I2S2,3 Clock Source
  * @{
  */
#define RCC_SPI23CLKSOURCE_PLL4       0U
#define RCC_SPI23CLKSOURCE_PLL3_Q     RCC_SPI2S23CKSELR_SPI23SRC_0
#define RCC_SPI23CLKSOURCE_I2SCKIN    RCC_SPI2S23CKSELR_SPI23SRC_1
#define RCC_SPI23CLKSOURCE_PER        (RCC_SPI2S23CKSELR_SPI23SRC_1 | RCC_SPI2S23CKSELR_SPI23SRC_0)
#define RCC_SPI23CLKSOURCE_PLL3_R     RCC_SPI2S23CKSELR_SPI23SRC_2

#define IS_RCC_SPI23CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI23CLKSOURCE_PLL4)    || \
   ((__SOURCE__) == RCC_SPI23CLKSOURCE_PLL3_Q)  || \
   ((__SOURCE__) == RCC_SPI23CLKSOURCE_I2SCKIN) || \
   ((__SOURCE__) == RCC_SPI23CLKSOURCE_PER)     || \
   ((__SOURCE__) == RCC_SPI23CLKSOURCE_PLL3_R))
/**
  * @}
  */


/** @defgroup RCCEx_SPI4_Clock_Source SPI4 Clock Source
  * @{
  */
#define RCC_SPI4CLKSOURCE_PCLK6        0U
#define RCC_SPI4CLKSOURCE_PLL4         RCC_SPI45CKSELR_SPI4SRC_0
#define RCC_SPI4CLKSOURCE_HSI          RCC_SPI45CKSELR_SPI4SRC_1
#define RCC_SPI4CLKSOURCE_CSI          (RCC_SPI45CKSELR_SPI4SRC_1 | RCC_SPI45CKSELR_SPI4SRC_0)
#define RCC_SPI4CLKSOURCE_HSE          RCC_SPI45CKSELR_SPI4SRC_2
#define RCC_SPI4CLKSOURCE_I2SCKIN      (RCC_SPI45CKSELR_SPI4SRC_2 | RCC_SPI45CKSELR_SPI4SRC_0)

#define IS_RCC_SPI4CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI4CLKSOURCE_PCLK6) || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_PLL4)  || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_CSI)   || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_HSE)   || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_I2SCKIN))
/**
  * @}
  */

/** @defgroup RCCEx_SPI5_Clock_Source SPI5 Clock Source
  * @{
  */
#define RCC_SPI5CLKSOURCE_PCLK6        0U
#define RCC_SPI5CLKSOURCE_PLL4         RCC_SPI45CKSELR_SPI5SRC_0
#define RCC_SPI5CLKSOURCE_HSI          RCC_SPI45CKSELR_SPI5SRC_1
#define RCC_SPI5CLKSOURCE_CSI          (RCC_SPI45CKSELR_SPI5SRC_1 | RCC_SPI45CKSELR_SPI5SRC_0)
#define RCC_SPI5CLKSOURCE_HSE          RCC_SPI45CKSELR_SPI5SRC_2

#define IS_RCC_SPI5CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI5CLKSOURCE_PCLK6) || \
   ((__SOURCE__) == RCC_SPI5CLKSOURCE_PLL4)  || \
   ((__SOURCE__) == RCC_SPI5CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPI5CLKSOURCE_CSI)   || \
   ((__SOURCE__) == RCC_SPI5CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_USART1_Clock_Source USART1 Clock Source
  * @{
  */
#define RCC_USART1CLKSOURCE_PCLK6       0U
#define RCC_USART1CLKSOURCE_PLL3        RCC_UART12CKSELR_UART1SRC_0
#define RCC_USART1CLKSOURCE_HSI         RCC_UART12CKSELR_UART1SRC_1
#define RCC_USART1CLKSOURCE_CSI         (RCC_UART12CKSELR_UART1SRC_1 | RCC_UART12CKSELR_UART1SRC_0)
#define RCC_USART1CLKSOURCE_PLL4        RCC_UART12CKSELR_UART1SRC_2
#define RCC_USART1CLKSOURCE_HSE         (RCC_UART12CKSELR_UART1SRC_2 | RCC_UART12CKSELR_UART1SRC_0)


#define IS_RCC_USART1CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_USART1CLKSOURCE_PCLK6) || \
   ((SOURCE) == RCC_USART1CLKSOURCE_PLL3)  || \
   ((SOURCE) == RCC_USART1CLKSOURCE_HSI)   || \
   ((SOURCE) == RCC_USART1CLKSOURCE_CSI)   || \
   ((SOURCE) == RCC_USART1CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_USART1CLKSOURCE_HSE))

/**
  * @}
  */

