zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc_ex.h
/** @defgroup RCCEx_USART2_Clock_Source USART2 Clock Source
  * @{
  */
#define RCC_USART2CLKSOURCE_PCLK6       0U
#define RCC_USART2CLKSOURCE_PLL3        RCC_UART12CKSELR_UART2SRC_0
#define RCC_USART2CLKSOURCE_HSI         RCC_UART12CKSELR_UART2SRC_1
#define RCC_USART2CLKSOURCE_CSI         (RCC_UART12CKSELR_UART2SRC_1 | RCC_UART12CKSELR_UART2SRC_0)
#define RCC_USART2CLKSOURCE_PLL4        RCC_UART12CKSELR_UART2SRC_2
#define RCC_USART2CLKSOURCE_HSE         (RCC_UART12CKSELR_UART2SRC_2 | RCC_UART12CKSELR_UART2SRC_0)


#define IS_RCC_USART2CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_USART2CLKSOURCE_PCLK6) || \
   ((SOURCE) == RCC_USART2CLKSOURCE_PLL3)  || \
   ((SOURCE) == RCC_USART2CLKSOURCE_HSI)   || \
   ((SOURCE) == RCC_USART2CLKSOURCE_CSI)   || \
   ((SOURCE) == RCC_USART2CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_USART2CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_UART4_Clock_Source UART4 Clock Source
  * @{
  */
#define RCC_UART4CLKSOURCE_PCLK1       0U
#define RCC_UART4CLKSOURCE_PLL4        RCC_UART4CKSELR_UART4SRC_0
#define RCC_UART4CLKSOURCE_HSI         RCC_UART4CKSELR_UART4SRC_1
#define RCC_UART4CLKSOURCE_CSI         (RCC_UART4CKSELR_UART4SRC_1 | RCC_UART4CKSELR_UART4SRC_0)
#define RCC_UART4CLKSOURCE_HSE         RCC_UART4CKSELR_UART4SRC_2


#define IS_RCC_UART4CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_UART4CLKSOURCE_PCLK1) || \
   ((SOURCE) == RCC_UART4CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_UART4CLKSOURCE_HSI)   || \
   ((SOURCE) == RCC_UART4CLKSOURCE_CSI)   || \
   ((SOURCE) == RCC_UART4CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_UART35_Clock_Source UART35 Clock Source
  * @{
  */
#define RCC_UART35CLKSOURCE_PCLK1        0U
#define RCC_UART35CLKSOURCE_PLL4         RCC_UART35CKSELR_UART35SRC_0
#define RCC_UART35CLKSOURCE_HSI          RCC_UART35CKSELR_UART35SRC_1
#define RCC_UART35CLKSOURCE_CSI          (RCC_UART35CKSELR_UART35SRC_1 | RCC_UART35CKSELR_UART35SRC_0)
#define RCC_UART35CLKSOURCE_HSE          RCC_UART35CKSELR_UART35SRC_2

#define IS_RCC_UART35CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_UART35CLKSOURCE_PCLK1) || \
   ((SOURCE) == RCC_UART35CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_UART35CLKSOURCE_HSI)   || \
   ((SOURCE) == RCC_UART35CLKSOURCE_CSI)   || \
   ((SOURCE) == RCC_UART35CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_USART6_Clock_Source USART6 Clock Source
  * @{
  */
#define RCC_USART6CLKSOURCE_PCLK2       0U
#define RCC_USART6CLKSOURCE_PLL4        RCC_UART6CKSELR_UART6SRC_0
#define RCC_USART6CLKSOURCE_HSI         RCC_UART6CKSELR_UART6SRC_1
#define RCC_USART6CLKSOURCE_CSI         (RCC_UART6CKSELR_UART6SRC_1 | RCC_UART6CKSELR_UART6SRC_0)
#define RCC_USART6CLKSOURCE_HSE         RCC_UART6CKSELR_UART6SRC_2

#define IS_RCC_USART6CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_USART6CLKSOURCE_PCLK2) || \
   ((SOURCE) == RCC_USART6CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_USART6CLKSOURCE_HSI)   || \
   ((SOURCE) == RCC_USART6CLKSOURCE_CSI)   || \
   ((SOURCE) == RCC_USART6CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_UART78_Clock_Source UART78 Clock Source
  * @{
  */
#define RCC_UART78CLKSOURCE_PCLK1        0U
#define RCC_UART78CLKSOURCE_PLL4         RCC_UART78CKSELR_UART78SRC_0
#define RCC_UART78CLKSOURCE_HSI          RCC_UART78CKSELR_UART78SRC_1
#define RCC_UART78CLKSOURCE_CSI          (RCC_UART78CKSELR_UART78SRC_1 | RCC_UART78CKSELR_UART78SRC_0)
#define RCC_UART78CLKSOURCE_HSE          RCC_UART78CKSELR_UART78SRC_2

#define IS_RCC_UART78CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_UART78CLKSOURCE_PCLK1) || \
   ((SOURCE) == RCC_UART78CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_UART78CLKSOURCE_HSI)   || \
   ((SOURCE) == RCC_UART78CLKSOURCE_CSI)   || \
   ((SOURCE) == RCC_UART78CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_SDMMC1_Clock_Source SDMMC1 Clock Source
  * @{
  */
#define RCC_SDMMC1CLKSOURCE_HCLK6       0U
#define RCC_SDMMC1CLKSOURCE_PLL3        RCC_SDMMC12CKSELR_SDMMC1SRC_0
#define RCC_SDMMC1CLKSOURCE_PLL4        RCC_SDMMC12CKSELR_SDMMC1SRC_1
#define RCC_SDMMC1CLKSOURCE_HSI         (RCC_SDMMC12CKSELR_SDMMC1SRC_1 | RCC_SDMMC12CKSELR_SDMMC1SRC_0)

#define IS_RCC_SDMMC1CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_SDMMC1CLKSOURCE_HCLK6) || \
   ((SOURCE) == RCC_SDMMC1CLKSOURCE_PLL3)  || \
   ((SOURCE) == RCC_SDMMC1CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_SDMMC1CLKSOURCE_HSI))
/**
  * @}
  */

/** @defgroup RCCEx_SDMMC2_Clock_Source SDMMC2 Clock Source
  * @{
  */
#define RCC_SDMMC2CLKSOURCE_HCLK6       0U
#define RCC_SDMMC2CLKSOURCE_PLL3        RCC_SDMMC12CKSELR_SDMMC2SRC_0
#define RCC_SDMMC2CLKSOURCE_PLL4        RCC_SDMMC12CKSELR_SDMMC2SRC_1
#define RCC_SDMMC2CLKSOURCE_HSI         (RCC_SDMMC12CKSELR_SDMMC2SRC_1 | RCC_SDMMC12CKSELR_SDMMC2SRC_0)

#define IS_RCC_SDMMC2CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_SDMMC2CLKSOURCE_HCLK6) || \
   ((SOURCE) == RCC_SDMMC2CLKSOURCE_PLL3)  || \
   ((SOURCE) == RCC_SDMMC2CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_SDMMC2CLKSOURCE_HSI))
/**
  * @}
  */

/** @defgroup RCCEx_ETH1_Clock_Source ETH1 Clock Source
  * @{
  */
#define RCC_ETH1CLKSOURCE_PLL4       0U
#define RCC_ETH1CLKSOURCE_PLL3       RCC_ETH12CKSELR_ETH1SRC_0
#define RCC_ETH1CLKSOURCE_OFF        RCC_ETH12CKSELR_ETH1SRC_1


#define IS_RCC_ETH1CLKSOURCE(SOURCE) (((SOURCE) == RCC_ETH1CLKSOURCE_PLL4)  || \
                                      ((SOURCE) == RCC_ETH1CLKSOURCE_PLL3)  || \
                                      ((SOURCE) == RCC_ETH1CLKSOURCE_OFF))
/**
  * @}
  */

/** @defgroup RCCEx_ETH2_Clock_Source ETH2 Clock Source
  * @{
  */
#define RCC_ETH2CLKSOURCE_PLL4       0U
#define RCC_ETH2CLKSOURCE_PLL3       RCC_ETH12CKSELR_ETH2SRC_0
#define RCC_ETH2CLKSOURCE_OFF        RCC_ETH12CKSELR_ETH2SRC_1


#define IS_RCC_ETH2CLKSOURCE(SOURCE) (((SOURCE) == RCC_ETH2CLKSOURCE_PLL4)  || \
                                      ((SOURCE) == RCC_ETH2CLKSOURCE_PLL3)  || \
                                      ((SOURCE) == RCC_ETH2CLKSOURCE_OFF))
/**
  * @}
  */

/** @defgroup RCCEx_ETH1_PrecisionTimeProtocol_Divider ETH1 PrecisionTimeProtocol Divider
  * @{
  */
#define RCC_ETH1PTPDIV_1   0U                                                 /*Bypass (default after reset*/
#define RCC_ETH1PTPDIV_2   RCC_ETH12CKSELR_ETH1PTPDIV_0                                     /*Division by 2*/
#define RCC_ETH1PTPDIV_3   RCC_ETH12CKSELR_ETH1PTPDIV_1                                     /*Division by 3*/
#define RCC_ETH1PTPDIV_4   (RCC_ETH12CKSELR_ETH1PTPDIV_1 | RCC_ETH12CKSELR_ETH1PTPDIV_0)    /*Division by 4*/
#define RCC_ETH1PTPDIV_5   RCC_ETH12CKSELR_ETH1PTPDIV_2                                     /*Division by 5*/
#define RCC_ETH1PTPDIV_6   (RCC_ETH12CKSELR_ETH1PTPDIV_2 | RCC_ETH12CKSELR_ETH1PTPDIV_0)    /*Division by 6*/
#define RCC_ETH1PTPDIV_7   (RCC_ETH12CKSELR_ETH1PTPDIV_2 | RCC_ETH12CKSELR_ETH1PTPDIV_1)    /*Division by 7*/
#define RCC_ETH1PTPDIV_8   (RCC_ETH12CKSELR_ETH1PTPDIV_2 | RCC_ETH12CKSELR_ETH1PTPDIV_1 | \
                            RCC_ETH12CKSELR_ETH1PTPDIV_0)  /*Division by 8*/
#define RCC_ETH1PTPDIV_9   RCC_ETH12CKSELR_ETH1PTPDIV_3                                     /*Division by 9*/
#define RCC_ETH1PTPDIV_10  (RCC_ETH12CKSELR_ETH1PTPDIV_3 | RCC_ETH12CKSELR_ETH1PTPDIV_0)    /*Division by 10*/
#define RCC_ETH1PTPDIV_11  (RCC_ETH12CKSELR_ETH1PTPDIV_3 | RCC_ETH12CKSELR_ETH1PTPDIV_1)    /*Division by 11*/
#define RCC_ETH1PTPDIV_12  (RCC_ETH12CKSELR_ETH1PTPDIV_3 | RCC_ETH12CKSELR_ETH1PTPDIV_1 | \
                            RCC_ETH12CKSELR_ETH1PTPDIV_0)  /*Division by 12*/
#define RCC_ETH1PTPDIV_13  (RCC_ETH12CKSELR_ETH1PTPDIV_3 | RCC_ETH12CKSELR_ETH1PTPDIV_2)    /*Division by 13*/
#define RCC_ETH1PTPDIV_14  (RCC_ETH12CKSELR_ETH1PTPDIV_3 | RCC_ETH12CKSELR_ETH1PTPDIV_2 | \
                            RCC_ETH12CKSELR_ETH1PTPDIV_0)  /*Division by 14*/
#define RCC_ETH1PTPDIV_15  (RCC_ETH12CKSELR_ETH1PTPDIV_3 | RCC_ETH12CKSELR_ETH1PTPDIV_2 | \
                            RCC_ETH12CKSELR_ETH1PTPDIV_1)  /*Division by 15*/
#define RCC_ETH1PTPDIV_16  (RCC_ETH12CKSELR_ETH1PTPDIV_3 | RCC_ETH12CKSELR_ETH1PTPDIV_2 | \
                            RCC_ETH12CKSELR_ETH1PTPDIV_1 | RCC_ETH12CKSELR_ETH1PTPDIV_0)  /*Division by 16*/


#define IS_RCC_ETH1PTPDIV(SOURCE)       (((SOURCE) == RCC_ETH1PTPDIV_1)  || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_2)  || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_3)  || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_4)  || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_5)  || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_6)  || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_7)  || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_8)  || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_9)  || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_10) || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_11) || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_12) || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_13) || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_14) || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_15) || \
                                         ((SOURCE) == RCC_ETH1PTPDIV_16))
/**
  * @}
  */

/** @defgroup RCCEx_ETH2_PrecisionTimeProtocol_Divider ETH2 PrecisionTimeProtocol Divider
  * @{
  */
#define RCC_ETH2PTPDIV_1   0U                                                 /*Bypass (default after reset*/
#define RCC_ETH2PTPDIV_2   RCC_ETH12CKSELR_ETH2PTPDIV_0                                     /*Division by 2*/
#define RCC_ETH2PTPDIV_3   RCC_ETH12CKSELR_ETH2PTPDIV_1                                     /*Division by 3*/
#define RCC_ETH2PTPDIV_4   (RCC_ETH12CKSELR_ETH2PTPDIV_1 | RCC_ETH12CKSELR_ETH2PTPDIV_0)    /*Division by 4*/
#define RCC_ETH2PTPDIV_5   RCC_ETH12CKSELR_ETH2PTPDIV_2                                     /*Division by 5*/
#define RCC_ETH2PTPDIV_6   (RCC_ETH12CKSELR_ETH2PTPDIV_2 | RCC_ETH12CKSELR_ETH2PTPDIV_0)    /*Division by 6*/
#define RCC_ETH2PTPDIV_7   (RCC_ETH12CKSELR_ETH2PTPDIV_2 | RCC_ETH12CKSELR_ETH2PTPDIV_1)    /*Division by 7*/
#define RCC_ETH2PTPDIV_8   (RCC_ETH12CKSELR_ETH2PTPDIV_2 | RCC_ETH12CKSELR_ETH2PTPDIV_1 | \
                            RCC_ETH12CKSELR_ETH2PTPDIV_0)  /*Division by 8*/
#define RCC_ETH2PTPDIV_9   RCC_ETH12CKSELR_ETH2PTPDIV_3                                     /*Division by 9*/
#define RCC_ETH2PTPDIV_10  (RCC_ETH12CKSELR_ETH2PTPDIV_3 | RCC_ETH12CKSELR_ETH2PTPDIV_0)    /*Division by 10*/
#define RCC_ETH2PTPDIV_11  (RCC_ETH12CKSELR_ETH2PTPDIV_3 | RCC_ETH12CKSELR_ETH2PTPDIV_1)    /*Division by 11*/
#define RCC_ETH2PTPDIV_12  (RCC_ETH12CKSELR_ETH2PTPDIV_3 | RCC_ETH12CKSELR_ETH2PTPDIV_1 | \
                            RCC_ETH12CKSELR_ETH2PTPDIV_0)  /*Division by 12*/
#define RCC_ETH2PTPDIV_13  (RCC_ETH12CKSELR_ETH2PTPDIV_3 | RCC_ETH12CKSELR_ETH2PTPDIV_2)    /*Division by 13*/
#define RCC_ETH2PTPDIV_14  (RCC_ETH12CKSELR_ETH2PTPDIV_3 | RCC_ETH12CKSELR_ETH2PTPDIV_2 | \
                            RCC_ETH12CKSELR_ETH2PTPDIV_0)  /*Division by 14*/
#define RCC_ETH2PTPDIV_15  (RCC_ETH12CKSELR_ETH2PTPDIV_3 | RCC_ETH12CKSELR_ETH2PTPDIV_2 | \
                            RCC_ETH12CKSELR_ETH2PTPDIV_1)  /*Division by 15*/
#define RCC_ETH2PTPDIV_16  (RCC_ETH12CKSELR_ETH2PTPDIV_3 | RCC_ETH12CKSELR_ETH2PTPDIV_2 | \
                            RCC_ETH12CKSELR_ETH2PTPDIV_1 | RCC_ETH12CKSELR_ETH2PTPDIV_0)  /*Division by 16*/


#define IS_RCC_ETH2PTPDIV(SOURCE)       (((SOURCE) == RCC_ETH2PTPDIV_1)  || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_2)  || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_3)  || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_4)  || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_5)  || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_6)  || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_7)  || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_8)  || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_9)  || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_10) || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_11) || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_12) || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_13) || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_14) || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_15) || \
                                         ((SOURCE) == RCC_ETH2PTPDIV_16))
/**
  * @}
  */


/** @defgroup RCCEx_QSPI_Clock_Source QSPI Clock Source
  * @{
  */
#define RCC_QSPICLKSOURCE_ACLK  0U
#define RCC_QSPICLKSOURCE_PLL3  RCC_QSPICKSELR_QSPISRC_0
#define RCC_QSPICLKSOURCE_PLL4  RCC_QSPICKSELR_QSPISRC_1
#define RCC_QSPICLKSOURCE_PER   (RCC_QSPICKSELR_QSPISRC_1 | RCC_QSPICKSELR_QSPISRC_0)

