zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc_ex.h
#define IS_RCC_QSPICLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_QSPICLKSOURCE_ACLK) || \
   ((SOURCE) == RCC_QSPICLKSOURCE_PLL3) || \
   ((SOURCE) == RCC_QSPICLKSOURCE_PLL4) || \
   ((SOURCE) == RCC_QSPICLKSOURCE_PER))
/**
  * @}
  */

/** @defgroup RCCEx_FMC_Clock_Source FMC Clock Source
  * @{
  */
#define RCC_FMCCLKSOURCE_ACLK       0U
#define RCC_FMCCLKSOURCE_PLL3       RCC_FMCCKSELR_FMCSRC_0
#define RCC_FMCCLKSOURCE_PLL4       RCC_FMCCKSELR_FMCSRC_1
#define RCC_FMCCLKSOURCE_PER        (RCC_FMCCKSELR_FMCSRC_1 | RCC_FMCCKSELR_FMCSRC_0)

#define IS_RCC_FMCCLKSOURCE(SOURCE) (((SOURCE) == RCC_FMCCLKSOURCE_ACLK)  || \
                                     ((SOURCE) == RCC_FMCCLKSOURCE_PLL3)  || \
                                     ((SOURCE) == RCC_FMCCLKSOURCE_PLL4)  || \
                                     ((SOURCE) == RCC_FMCCLKSOURCE_PER))
/**
  * @}
  */

#if defined(RCC_PERIPHCLK_FDCAN)
/** @defgroup RCCEx_FDCAN_Clock_Source FDCAN Clock Source
  * @{
  */
#define RCC_FDCANCLKSOURCE_HSE          0U
#define RCC_FDCANCLKSOURCE_PLL3         RCC_FDCANCKSELR_FDCANSRC_0
#define RCC_FDCANCLKSOURCE_PLL4_Q       RCC_FDCANCKSELR_FDCANSRC_1
#define RCC_FDCANCLKSOURCE_PLL4_R       (RCC_FDCANCKSELR_FDCANSRC_1 | RCC_FDCANCKSELR_FDCANSRC_0)


#define IS_RCC_FDCANCLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_FDCANCLKSOURCE_HSE)     || \
   ((SOURCE) == RCC_FDCANCLKSOURCE_PLL3)    || \
   ((SOURCE) == RCC_FDCANCLKSOURCE_PLL4_Q)  || \
   ((SOURCE) == RCC_FDCANCLKSOURCE_PLL4_R))
/**
  * @}
  */
#endif /* RCC_PERIPHCLK_FDCAN */

/** @defgroup RCCEx_SPDIFRX_Clock_Source SPDIFRX Clock Source
  * @{
  */
#define RCC_SPDIFRXCLKSOURCE_PLL4         0U
#define RCC_SPDIFRXCLKSOURCE_PLL3         RCC_SPDIFCKSELR_SPDIFSRC_0
#define RCC_SPDIFRXCLKSOURCE_HSI          RCC_SPDIFCKSELR_SPDIFSRC_1

#define IS_RCC_SPDIFRXCLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_SPDIFRXCLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_SPDIFRXCLKSOURCE_PLL3)  || \
   ((SOURCE) == RCC_SPDIFRXCLKSOURCE_HSI))
/**
  * @}
  */

/** @defgroup RCCEx_USBPHY_Clock_Source USBPHY Clock Source
  * @{
  */
#define RCC_USBPHYCLKSOURCE_HSE         0U
#define RCC_USBPHYCLKSOURCE_PLL4        RCC_USBCKSELR_USBPHYSRC_0
#define RCC_USBPHYCLKSOURCE_HSE2        RCC_USBCKSELR_USBPHYSRC_1

#define IS_RCC_USBPHYCLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_USBPHYCLKSOURCE_HSE) || \
   ((SOURCE) ==RCC_USBPHYCLKSOURCE_PLL4) || \
   ((SOURCE) ==RCC_USBPHYCLKSOURCE_HSE2))
/**
  * @}
  */

/** @defgroup RCCEx_USBO_Clock_Source USBO Clock Source
  * @{
  */
#define RCC_USBOCLKSOURCE_PLL4            0U
#define RCC_USBOCLKSOURCE_PHY             RCC_USBCKSELR_USBOSRC

#define IS_RCC_USBOCLKSOURCE(SOURCE)  (((SOURCE) == RCC_USBOCLKSOURCE_PLL4) || \
                                       ((SOURCE) == RCC_USBOCLKSOURCE_PHY))
/**
  * @}
  */


/** @defgroup RCCEx_RNG1_Clock_Source RNG1 Clock Source
  * @{
  */
#define RCC_RNG1CLKSOURCE_CSI         0U
#define RCC_RNG1CLKSOURCE_PLL4        RCC_RNG1CKSELR_RNG1SRC_0
#define RCC_RNG1CLKSOURCE_LSI         (RCC_RNG1CKSELR_RNG1SRC_1 | RCC_RNG1CKSELR_RNG1SRC_0)

#define IS_RCC_RNG1CLKSOURCE(SOURCE)  (((SOURCE) == RCC_RNG1CLKSOURCE_CSI)  || \
                                       ((SOURCE) == RCC_RNG1CLKSOURCE_PLL4) || \
                                       ((SOURCE) == RCC_RNG1CLKSOURCE_LSI))

/**
  * @}
  */

/** @defgroup RCCEx_CKPER_Clock_Source CKPER Clock Source
  * @{
  */
#define RCC_CKPERCLKSOURCE_HSI          0U
#define RCC_CKPERCLKSOURCE_CSI          RCC_CPERCKSELR_CKPERSRC_0
#define RCC_CKPERCLKSOURCE_HSE          RCC_CPERCKSELR_CKPERSRC_1
#define RCC_CKPERCLKSOURCE_OFF          (RCC_CPERCKSELR_CKPERSRC_1 | RCC_CPERCKSELR_CKPERSRC_0) /*Clock disabled*/

#define IS_RCC_CKPERCLKSOURCE(SOURCE) (((SOURCE) == RCC_CKPERCLKSOURCE_HSI) || \
                                       ((SOURCE) == RCC_CKPERCLKSOURCE_CSI) || \
                                       ((SOURCE) == RCC_CKPERCLKSOURCE_HSE) || \
                                       ((SOURCE) == RCC_CKPERCLKSOURCE_OFF))
/**
  * @}
  */


/** @defgroup RCCEx_STGEN_Clock_Source STGEN Clock Source
  * @{
  */
#define RCC_STGENCLKSOURCE_HSI          0U
#define RCC_STGENCLKSOURCE_HSE          RCC_STGENCKSELR_STGENSRC_0
#define RCC_STGENCLKSOURCE_OFF          RCC_STGENCKSELR_STGENSRC_1

#define IS_RCC_STGENCLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_STGENCLKSOURCE_HSI) || \
   ((SOURCE) == RCC_STGENCLKSOURCE_HSE) || \
   ((SOURCE) == RCC_STGENCLKSOURCE_OFF))
/**
  * @}
  */

#if defined(RCC_PERIPHCLK_DCMIPP)
/** @defgroup RCCEx_DCMIPP_Clock_Source DCMIPP Clock Source
  * @{
  */
#define RCC_DCMIPPCLKSOURCE_ACLK         0U
#define RCC_DCMIPPCLKSOURCE_PLL2         RCC_DCMIPPCKSELR_DCMIPPSRC_0
#define RCC_DCMIPPCLKSOURCE_PLL4         RCC_DCMIPPCKSELR_DCMIPPSRC_1
#define RCC_DCMIPPCLKSOURCE_PER          (RCC_DCMIPPCKSELR_DCMIPPSRC_1 | RCC_DCMIPPCKSELR_DCMIPPSRC_0)

#define IS_RCC_DCMIPPCLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_DCMIPPCLKSOURCE_ACLK) || \
   ((SOURCE) == RCC_DCMIPPCLKSOURCE_PLL2) || \
   ((SOURCE) == RCC_DCMIPPCLKSOURCE_PLL4) || \
   ((SOURCE) == RCC_DCMIPPCLKSOURCE_PER))
/**
  * @}
  */
#endif /* RCC_PERIPHCLK_DCMIPP */

#if defined(RCC_PERIPHCLK_SAES)
/** @defgroup RCCEx_SAES_Clock_Source SAES Clock Source
  * @{
  */
#define RCC_SAESCLKSOURCE_ACLK           0U
#define RCC_SAESCLKSOURCE_PER            RCC_SAESCKSELR_SAESSRC_0
#define RCC_SAESCLKSOURCE_PLL4           RCC_SAESCKSELR_SAESSRC_1
#define RCC_SAESCLKSOURCE_LSI            (RCC_SAESCKSELR_SAESSRC_1 | RCC_SAESCKSELR_SAESSRC_0)

#define IS_RCC_SAESCLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_SAESCLKSOURCE_ACLK) || \
   ((SOURCE) == RCC_SAESCLKSOURCE_PER)  || \
   ((SOURCE) == RCC_SAESCLKSOURCE_PLL4) || \
   ((SOURCE) == RCC_SAESCLKSOURCE_LSI))
/**
  * @}
  */
#endif /* RCC_PERIPHCLK_SAES */

/** @defgroup RCCEx_ADC1_Clock_Source ADC1 Clock Source
  * @{
  */
#define RCC_ADC1CLKSOURCE_PLL4           0U
#define RCC_ADC1CLKSOURCE_PER            RCC_ADC12CKSELR_ADC1SRC_0
#define RCC_ADC1CLKSOURCE_PLL3           RCC_ADC12CKSELR_ADC1SRC_1

#define IS_RCC_ADC1CLKSOURCE(SOURCE) (((SOURCE) == RCC_ADC1CLKSOURCE_PLL4)  || \
                                      ((SOURCE) == RCC_ADC1CLKSOURCE_PER)   || \
                                      ((SOURCE) == RCC_ADC1CLKSOURCE_PLL3))
/**
  * @}
  */

