zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc_ex.h
/** @defgroup RCCEx_ADC2_Clock_Source ADC2 Clock Source
  * @{
  */
#define RCC_ADC2CLKSOURCE_PLL4           0U
#define RCC_ADC2CLKSOURCE_PER            RCC_ADC12CKSELR_ADC2SRC_0
#define RCC_ADC2CLKSOURCE_PLL3           RCC_ADC12CKSELR_ADC2SRC_1

#define IS_RCC_ADC2CLKSOURCE(SOURCE) (((SOURCE) == RCC_ADC2CLKSOURCE_PLL4)  || \
                                      ((SOURCE) == RCC_ADC2CLKSOURCE_PER)   || \
                                      ((SOURCE) == RCC_ADC2CLKSOURCE_PLL3))
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM1_Clock_Source LPTIM1 Clock Source
  * @{
  */
#define RCC_LPTIM1CLKSOURCE_PCLK1       0U
#define RCC_LPTIM1CLKSOURCE_PLL4        RCC_LPTIM1CKSELR_LPTIM1SRC_0
#define RCC_LPTIM1CLKSOURCE_PLL3        RCC_LPTIM1CKSELR_LPTIM1SRC_1
#define RCC_LPTIM1CLKSOURCE_LSE         (RCC_LPTIM1CKSELR_LPTIM1SRC_1 | RCC_LPTIM1CKSELR_LPTIM1SRC_0)
#define RCC_LPTIM1CLKSOURCE_LSI         RCC_LPTIM1CKSELR_LPTIM1SRC_2
#define RCC_LPTIM1CLKSOURCE_PER         (RCC_LPTIM1CKSELR_LPTIM1SRC_2 | RCC_LPTIM1CKSELR_LPTIM1SRC_0)
#define RCC_LPTIM1CLKSOURCE_OFF         (RCC_LPTIM1CKSELR_LPTIM1SRC_2 | RCC_LPTIM1CKSELR_LPTIM1SRC_1)

#define IS_RCC_LPTIM1CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_LPTIM1CLKSOURCE_PCLK1) || \
   ((SOURCE) == RCC_LPTIM1CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_LPTIM1CLKSOURCE_PLL3)  || \
   ((SOURCE) == RCC_LPTIM1CLKSOURCE_LSE)   || \
   ((SOURCE) == RCC_LPTIM1CLKSOURCE_LSI)   || \
   ((SOURCE) == RCC_LPTIM1CLKSOURCE_PER)   || \
   ((SOURCE) == RCC_LPTIM1CLKSOURCE_OFF))
/**
  * @}
  */

#if defined(RCC_LPTIM23CKSELR_LPTIM23SRC)
/** @defgroup RCCEx_LPTIM23_Clock_Source LPTIM23 Clock Source
  * @{
  */
#define RCC_LPTIM23CLKSOURCE_PCLK3       0U
#define RCC_LPTIM23CLKSOURCE_PLL4        RCC_LPTIM23CKSELR_LPTIM23SRC_0
#define RCC_LPTIM23CLKSOURCE_PER         RCC_LPTIM23CKSELR_LPTIM23SRC_1
#define RCC_LPTIM23CLKSOURCE_LSE         (RCC_LPTIM23CKSELR_LPTIM23SRC_1 | RCC_LPTIM23CKSELR_LPTIM23SRC_0)
#define RCC_LPTIM23CLKSOURCE_LSI         RCC_LPTIM23CKSELR_LPTIM23SRC_2
#define RCC_LPTIM23CLKSOURCE_OFF         (RCC_LPTIM23CKSELR_LPTIM23SRC_2 | RCC_LPTIM23CKSELR_LPTIM23SRC_0)


#define IS_RCC_LPTIM23CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_LPTIM23CLKSOURCE_PCLK3) || \
   ((SOURCE) == RCC_LPTIM23CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_LPTIM23CLKSOURCE_PER)   || \
   ((SOURCE) == RCC_LPTIM23CLKSOURCE_LSE)   || \
   ((SOURCE) == RCC_LPTIM23CLKSOURCE_LSI)   || \
   ((SOURCE) == RCC_LPTIM23CLKSOURCE_OFF))
/**
  * @}
  */
#endif /* RCC_LPTIM23CKSELR_LPTIM23SRC */

#if defined(RCC_LPTIM23CKSELR_LPTIM2SRC)
/** @defgroup RCCEx_LPTIM2_Clock_Source LPTIM2 Clock Source
  * @{
  */
#define RCC_LPTIM2CLKSOURCE_PCLK3       0U
#define RCC_LPTIM2CLKSOURCE_PLL4        RCC_LPTIM23CKSELR_LPTIM2SRC_0
#define RCC_LPTIM2CLKSOURCE_PER         RCC_LPTIM23CKSELR_LPTIM2SRC_1
#define RCC_LPTIM2CLKSOURCE_LSE         (RCC_LPTIM23CKSELR_LPTIM2SRC_1 | RCC_LPTIM23CKSELR_LPTIM2SRC_0)
#define RCC_LPTIM2CLKSOURCE_LSI         RCC_LPTIM23CKSELR_LPTIM2SRC_2
#define RCC_LPTIM2CLKSOURCE_OFF         (RCC_LPTIM23CKSELR_LPTIM2SRC_2 | RCC_LPTIM23CKSELR_LPTIM2SRC_0)


#define IS_RCC_LPTIM2CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_LPTIM2CLKSOURCE_PCLK3) || \
   ((SOURCE) == RCC_LPTIM2CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_LPTIM2CLKSOURCE_PER)   || \
   ((SOURCE) == RCC_LPTIM2CLKSOURCE_LSE)   || \
   ((SOURCE) == RCC_LPTIM2CLKSOURCE_LSI)   || \
   ((SOURCE) == RCC_LPTIM2CLKSOURCE_OFF))
/**
  * @}
  */
#endif /* RCC_LPTIM23CKSELR_LPTIM2SRC */

#if defined(RCC_LPTIM23CKSELR_LPTIM3SRC)
/** @defgroup RCCEx_LPTIM3_Clock_Source LPTIM3 Clock Source
  * @{
  */
#define RCC_LPTIM3CLKSOURCE_PCLK3       0U
#define RCC_LPTIM3CLKSOURCE_PLL4        RCC_LPTIM23CKSELR_LPTIM3SRC_0
#define RCC_LPTIM3CLKSOURCE_PER         RCC_LPTIM23CKSELR_LPTIM3SRC_1
#define RCC_LPTIM3CLKSOURCE_LSE         (RCC_LPTIM23CKSELR_LPTIM3SRC_1 | RCC_LPTIM23CKSELR_LPTIM3SRC_0)
#define RCC_LPTIM3CLKSOURCE_LSI         RCC_LPTIM23CKSELR_LPTIM3SRC_2
#define RCC_LPTIM3CLKSOURCE_OFF         (RCC_LPTIM23CKSELR_LPTIM3SRC_2 | RCC_LPTIM23CKSELR_LPTIM3SRC_0)


#define IS_RCC_LPTIM3CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_LPTIM3CLKSOURCE_PCLK3) || \
   ((SOURCE) == RCC_LPTIM3CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_LPTIM3CLKSOURCE_PER)   || \
   ((SOURCE) == RCC_LPTIM3CLKSOURCE_LSE)   || \
   ((SOURCE) == RCC_LPTIM3CLKSOURCE_LSI)   || \
   ((SOURCE) == RCC_LPTIM3CLKSOURCE_OFF))
/**
  * @}
  */
#endif /* RCC_LPTIM23CKSELR_LPTIM3SRC */

/** @defgroup RCCEx_LPTIM45_Clock_Source LPTIM45 Clock Source
  * @{
  */
#define RCC_LPTIM45CLKSOURCE_PCLK3      0U
#define RCC_LPTIM45CLKSOURCE_PLL4       RCC_LPTIM45CKSELR_LPTIM45SRC_0
#define RCC_LPTIM45CLKSOURCE_PLL3       RCC_LPTIM45CKSELR_LPTIM45SRC_1
#define RCC_LPTIM45CLKSOURCE_LSE        (RCC_LPTIM45CKSELR_LPTIM45SRC_1 | RCC_LPTIM45CKSELR_LPTIM45SRC_0)
#define RCC_LPTIM45CLKSOURCE_LSI        RCC_LPTIM45CKSELR_LPTIM45SRC_2
#define RCC_LPTIM45CLKSOURCE_PER        (RCC_LPTIM45CKSELR_LPTIM45SRC_2 | RCC_LPTIM45CKSELR_LPTIM45SRC_0)
#define RCC_LPTIM45CLKSOURCE_OFF        (RCC_LPTIM45CKSELR_LPTIM45SRC_2 | RCC_LPTIM45CKSELR_LPTIM45SRC_1)


#define IS_RCC_LPTIM45CLKSOURCE(SOURCE) \
  (((SOURCE) == RCC_LPTIM45CLKSOURCE_PCLK3) || \
   ((SOURCE) == RCC_LPTIM45CLKSOURCE_PLL4)  || \
   ((SOURCE) == RCC_LPTIM45CLKSOURCE_PLL3)  || \
   ((SOURCE) == RCC_LPTIM45CLKSOURCE_LSE)   || \
   ((SOURCE) == RCC_LPTIM45CLKSOURCE_LSI)   || \
   ((SOURCE) == RCC_LPTIM45CLKSOURCE_PER)   || \
   ((SOURCE) == RCC_LPTIM45CLKSOURCE_OFF))
/**
  * @}
  */


/** @defgroup RCCEx_TIMG1_Prescaler_Selection TIMG1 Prescaler Selection
  * @{
  */
#define RCC_TIMG1PRES_DEACTIVATED                0U
#define RCC_TIMG1PRES_ACTIVATED                  RCC_TIMG1PRER_TIMG1PRE

#define IS_RCC_TIMG1PRES(PRES)  (((PRES) == RCC_TIMG1PRES_DEACTIVATED)    || \
                                 ((PRES) == RCC_TIMG1PRES_ACTIVATED))
/**
  * @}
  */


/** @defgroup RCCEx_TIMG2_Prescaler_Selection TIMG2 Prescaler Selection
  * @{
  */
#define RCC_TIMG2PRES_DEACTIVATED                0U
#define RCC_TIMG2PRES_ACTIVATED                  RCC_TIMG2PRER_TIMG2PRE

#define IS_RCC_TIMG2PRES(PRES)  (((PRES) == RCC_TIMG2PRES_DEACTIVATED)    || \
                                 ((PRES) == RCC_TIMG2PRES_ACTIVATED))
/**
  * @}
  */

/** @defgroup RCCEx_TIMG3_Prescaler_Selection TIMG3 Prescaler Selection
  * @{
  */
#define RCC_TIMG3PRES_DEACTIVATED                0U
#define RCC_TIMG3PRES_ACTIVATED                  RCC_TIMG3PRER_TIMG3PRE

