zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc_ex.h
#define IS_RCC_TIMG3PRES(PRES)  (((PRES) == RCC_TIMG3PRES_DEACTIVATED)    || \
                                 ((PRES) == RCC_TIMG3PRES_ACTIVATED))
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Macros RCCEx Exported Macros
  * @{
  */
/** @brief macro to configure the I2C12 clock (I2C12CLK).
  *
  * @param  __I2C12CLKSource__: specifies the I2C12 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C12CLKSOURCE_PCLK1:  PCLK1 selected as I2C12 clock (default after reset)
  *            @arg RCC_I2C12CLKSOURCE_PLL4:   PLL4_R selected as I2C12 clock
  *            @arg RCC_I2C12CLKSOURCE_HSI:    HSI selected as I2C12 clock
  *            @arg RCC_I2C12CLKSOURCE_CSI:    CSI selected as I2C12 clock
  * @retval None
  */
#define __HAL_RCC_I2C12_CONFIG(__I2C12CLKSource__) \
  MODIFY_REG(RCC->I2C12CKSELR, RCC_I2C12CKSELR_I2C12SRC, (uint32_t)(__I2C12CLKSource__))

/** @brief  macro to get the I2C12 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C12CLKSOURCE_PCLK1:  PCLK1 selected as I2C12 clock
  *            @arg RCC_I2C12CLKSOURCE_PLL4:   PLL4_R selected as I2C12 clock
  *            @arg RCC_I2C12CLKSOURCE_HSI:    HSI selected as I2C12 clock
  *            @arg RCC_I2C12CLKSOURCE_CSI:    CSI selected as I2C12 clock
  */
#define __HAL_RCC_GET_I2C12_SOURCE() ((uint32_t)(READ_BIT(RCC->I2C12CKSELR, RCC_I2C12CKSELR_I2C12SRC)))

#if defined(RCC_I2C35CKSELR_I2C35SRC)
/** @brief macro to configure the I2C35 clock (I2C35CLK).
  *
  * @param  __I2C35CLKSource__: specifies the I2C35 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C35CLKSOURCE_PCLK1:  PCLK1 selected as I2C35 clock (default after reset)
  *            @arg RCC_I2C35CLKSOURCE_PLL4:   PLL4_R selected as I2C35 clock
  *            @arg RCC_I2C35CLKSOURCE_HSI:    HSI selected as I2C35 clock
  *            @arg RCC_I2C35CLKSOURCE_CSI:    CSI selected as I2C35 clock
  * @retval None
  */
#define __HAL_RCC_I2C35_CONFIG(__I2C35CLKSource__) \
  MODIFY_REG(RCC->I2C35CKSELR, RCC_I2C35CKSELR_I2C35SRC, (uint32_t)(__I2C35CLKSource__))

/** @brief  macro to get the I2C35 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C35CLKSOURCE_PCLK1:  PCLK1 selected as I2C35 clock
  *            @arg RCC_I2C35CLKSOURCE_PLL4:   PLL4_R selected as I2C35 clock
  *            @arg RCC_I2C35CLKSOURCE_HSI:    HSI selected as I2C35 clock
  *            @arg RCC_I2C35CLKSOURCE_CSI:    CSI selected as I2C35 clock
  */
#define __HAL_RCC_GET_I2C35_SOURCE() ((uint32_t)(READ_BIT(RCC->I2C35CKSELR, RCC_I2C35CKSELR_I2C35SRC)))
#endif /* RCC_I2C35CKSELR_I2C35SRC */

#if defined(RCC_I2C46CKSELR_I2C46SRC)
/** @brief macro to configure the I2C46 clock (I2C46CLK).
  *
  * @param  __I2C46CLKSource__: specifies the I2C46 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C46CLKSOURCE_PCLK5:  PCLK5 selected as I2C46 clock (default after reset)
  *            @arg RCC_I2C46CLKSOURCE_PLL3:   PLL3_Q selected as I2C46 clock
  *            @arg RCC_I2C46CLKSOURCE_HSI:    HSI selected as I2C46 clock
  *            @arg RCC_I2C46CLKSOURCE_CSI:    CSI selected as I2C46 clock
  * @retval None
  */
#define __HAL_RCC_I2C46_CONFIG(__I2C46CLKSource__) \
  MODIFY_REG(RCC->I2C46CKSELR, RCC_I2C46CKSELR_I2C46SRC, (uint32_t)(__I2C46CLKSource__))

/** @brief  macro to get the I2C46 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C46CLKSOURCE_PCLK5:  PCLK5 selected as I2C46 clock
  *            @arg RCC_I2C46CLKSOURCE_PLL3:   PLL3_Q selected as I2C46 clock
  *            @arg RCC_I2C46CLKSOURCE_HSI:    HSI selected as I2C46 clock
  *            @arg RCC_I2C46CLKSOURCE_CSI:    CSI selected as I2C46 clock
  */
#define __HAL_RCC_GET_I2C46_SOURCE() ((uint32_t)(READ_BIT(RCC->I2C46CKSELR, RCC_I2C46CKSELR_I2C46SRC)))
#endif /* RCC_I2C46CKSELR_I2C46SRC */

/** @brief macro to configure the I2C3 clock (I2C3CLK).
  *
  * @param  __I2C3CLKSource__: specifies the I2C3 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C3CLKSOURCE_PCLK6:  PCLK6 selected as I2C3 clock (default after reset)
  *            @arg RCC_I2C3CLKSOURCE_PLL4:   PLL4_R selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_HSI:    HSI selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_CSI:    CSI selected as I2C3 clock
  * @retval None
  */
#define __HAL_RCC_I2C3_CONFIG(__I2C3CLKSource__) \
  MODIFY_REG(RCC->I2C345CKSELR, RCC_I2C345CKSELR_I2C3SRC, (uint32_t)(__I2C3CLKSource__))

/** @brief  macro to get the I2C3 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C3CLKSOURCE_PCLK6:  PCLK6 selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_PLL4:   PLL4_R selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_HSI:    HSI selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_CSI:    CSI selected as I2C3 clock
  */
#define __HAL_RCC_GET_I2C3_SOURCE() ((uint32_t)(READ_BIT(RCC->I2C345CKSELR, RCC_I2C345CKSELR_I2C3SRC)))

/** @brief macro to configure the I2C4 clock (I2C4CLK).
  *
  * @param  __I2C4CLKSource__: specifies the I2C4 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C4CLKSOURCE_PCLK6:  PCLK6 selected as I2C4 clock (default after reset)
  *            @arg RCC_I2C4CLKSOURCE_PLL4:   PLL4_R selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_HSI:    HSI selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_CSI:    CSI selected as I2C4 clock
  * @retval None
  */
#define __HAL_RCC_I2C4_CONFIG(__I2C4CLKSource__) \
  MODIFY_REG(RCC->I2C345CKSELR, RCC_I2C345CKSELR_I2C4SRC, (uint32_t)(__I2C4CLKSource__))

/** @brief  macro to get the I2C4 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C4CLKSOURCE_PCLK6:  PCLK6 selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_PLL4:   PLL4_R selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_HSI:    HSI selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_CSI:    CSI selected as I2C4 clock
  */
#define __HAL_RCC_GET_I2C4_SOURCE() ((uint32_t)(READ_BIT(RCC->I2C345CKSELR, RCC_I2C345CKSELR_I2C4SRC)))

/** @brief macro to configure the I2C5 clock (I2C5CLK).
  *
  * @param  __I2C5CLKSource__: specifies the I2C5 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C5CLKSOURCE_PCLK6:  PCLK6 selected as I2C5 clock (default after reset)
  *            @arg RCC_I2C5CLKSOURCE_PLL4:   PLL4_R selected as I2C5 clock
  *            @arg RCC_I2C5CLKSOURCE_HSI:    HSI selected as I2C5 clock
  *            @arg RCC_I2C5CLKSOURCE_CSI:    CSI selected as I2C5 clock
  * @retval None
  */
#define __HAL_RCC_I2C5_CONFIG(__I2C5CLKSource__) \
  MODIFY_REG(RCC->I2C345CKSELR, RCC_I2C345CKSELR_I2C5SRC, (uint32_t)(__I2C5CLKSource__))

