zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc_ex.h
/** @brief  Macro to get the SPI4 clock source.
  * @retval The clock source can be one of the following values:
  *             @arg RCC_SPI4CLKSOURCE_PCLK6:   SPI4 clock = PCLK6
  *             @arg RCC_SPI4CLKSOURCE_PLL4:    SPI4 clock = PLL4Q
  *             @arg RCC_SPI4CLKSOURCE_HSI:     SPI4 clock = HSI
  *             @arg RCC_SPI4CLKSOURCE_CSI:     SPI4 clock = CSI
  *             @arg RCC_SPI4CLKSOURCE_HSE:     SPI4 clock = HSE
  *             @arg RCC_SPI4CLKSOURCE_I2SCKIN: SPI4 clock = I2SCKIN
  */
#define __HAL_RCC_GET_SPI4_SOURCE() ((uint32_t)(READ_BIT(RCC->SPI45CKSELR, RCC_SPI45CKSELR_SPI4SRC)))

/**
  * @brief  Macro to Configure the SPI5 clock source.
  * @param  __RCC_SPI5CLKSource__: defines the SPI5 clock source.
  *          This parameter can be one of the following values:
  *             @arg RCC_SPI5CLKSOURCE_PCLK6:   SPI5 clock = PCLK6
  *             @arg RCC_SPI5CLKSOURCE_PLL4:    SPI5 clock = PLL4Q
  *             @arg RCC_SPI5CLKSOURCE_HSI:     SPI5 clock = HSI
  *             @arg RCC_SPI5CLKSOURCE_CSI:     SPI5 clock = CSI
  *             @arg RCC_SPI5CLKSOURCE_HSE:     SPI5 clock = HSE
  * @retval None
  */
#define __HAL_RCC_SPI5_CONFIG(__RCC_SPI5CLKSource__ ) \
  MODIFY_REG(RCC->SPI45CKSELR, RCC_SPI45CKSELR_SPI5SRC, (uint32_t)(__RCC_SPI5CLKSource__))

/** @brief  Macro to get the SPI5 clock source.
  * @retval The clock source can be one of the following values:
  *             @arg RCC_SPI5CLKSOURCE_PCLK6:   SPI5 clock = PCLK6
  *             @arg RCC_SPI5CLKSOURCE_PLL4:    SPI5 clock = PLL4Q
  *             @arg RCC_SPI5CLKSOURCE_HSI:     SPI5 clock = HSI
  *             @arg RCC_SPI5CLKSOURCE_CSI:     SPI5 clock = CSI
  *             @arg RCC_SPI5CLKSOURCE_HSE:     SPI5 clock = HSE
  */
#define __HAL_RCC_GET_SPI5_SOURCE() ((uint32_t)(READ_BIT(RCC->SPI45CKSELR, RCC_SPI45CKSELR_SPI5SRC)))


/** @brief macro to configure the USART1 clock (USART1CLK).
  *
  * @param  __USART1CLKSource__: specifies the USART1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USART1CLKSOURCE_PCLK6:  PCLK6 Clock selected as USART1 clock (default after reset)
  *            @arg RCC_USART1CLKSOURCE_PLL3:   PLL3_Q Clock selected as USART1 clock USART1
  *            @arg RCC_USART1CLKSOURCE_HSI:    HSI Clock selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_CSI:    CSI Clock selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_PLL4:   PLL4_Q Clock selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_HSE:    HSE Clock selected as USART1 clock
  * @retval None
  */
#define __HAL_RCC_USART1_CONFIG(__USART1CLKSource__) \
  MODIFY_REG(RCC->UART12CKSELR, RCC_UART12CKSELR_UART1SRC, (uint32_t)(__USART1CLKSource__))

/** @brief  macro to get the USART1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USART1CLKSOURCE_PCLK6:  PCLK6 Clock selected as USART1 clock (default after reset)
  *            @arg RCC_USART1CLKSOURCE_PLL3:   PLL3_Q Clock selected as USART1
  *            @arg RCC_USART1CLKSOURCE_HSI:    HSI Clock selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_CSI:    CSI Clock selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_PLL4:   PLL4_Q Clock selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_HSE:    HSE Clock selected as USART1 clock
  */
#define __HAL_RCC_GET_USART1_SOURCE() ((uint32_t)(READ_BIT(RCC->UART12CKSELR, RCC_UART12CKSELR_UART1SRC)))


/** @brief macro to configure the USART2 clock (USART2CLK).
  *
  * @param  __USART2CLKSource__: specifies the USART2 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USART2CLKSOURCE_PCLK6:  PCLK6 Clock selected as USART2 clock (default after reset)
  *            @arg RCC_USART2CLKSOURCE_PLL3:   PLL3_Q Clock selected as USART2 clock USART2
  *            @arg RCC_USART2CLKSOURCE_HSI:    HSI Clock selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_CSI:    CSI Clock selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_PLL4:   PLL4_Q Clock selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_HSE:    HSE Clock selected as USART2 clock
  * @retval None
  */
#define __HAL_RCC_USART2_CONFIG(__USART2CLKSource__) \
  MODIFY_REG(RCC->UART12CKSELR, RCC_UART12CKSELR_UART2SRC, (uint32_t)(__USART2CLKSource__))

/** @brief  macro to get the USART2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USART2CLKSOURCE_PCLK6:  PCLK6 Clock selected as USART2 clock (default after reset)
  *            @arg RCC_USART2CLKSOURCE_PLL3:   PLL3_Q Clock selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_HSI:    HSI Clock selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_CSI:    CSI Clock selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_PLL4:   PLL4_Q Clock selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_HSE:    HSE Clock selected as USART2 clock
  */
#define __HAL_RCC_GET_USART2_SOURCE() ((uint32_t)(READ_BIT(RCC->UART12CKSELR, RCC_UART12CKSELR_UART2SRC)))

/** @brief macro to configure the UART4 clock (UART4CLK).
  *
  * @param  __UART4CLKSource__: specifies the UART4 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_UART4CLKSOURCE_PCLK1:  PCLK1 Clock selected as UART4 clock (default after reset)
  *            @arg RCC_UART4CLKSOURCE_PLL4:   PLL4_Q Clock selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_HSI:    HSI Clock selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_CSI:    CSI Clock selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_HSE:    HSE Clock selected as UART4 clock
  * @retval None
  */
#define __HAL_RCC_UART4_CONFIG(__UART4CLKSource__) \
  MODIFY_REG(RCC->UART4CKSELR, RCC_UART4CKSELR_UART4SRC, (uint32_t)(__UART4CLKSource__))

/** @brief  macro to get the UART4 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_UART4CLKSOURCE_PCLK1:  PCLK1 Clock selected as UART4 clock (default after reset)
  *            @arg RCC_UART4CLKSOURCE_PLL4:   PLL4_Q Clock selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_HSI:    HSI Clock selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_CSI:    CSI Clock selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_HSE:    HSE Clock selected as UART4 clock
  */
#define __HAL_RCC_GET_UART4_SOURCE() ((uint32_t)(READ_BIT(RCC->UART4CKSELR, RCC_UART4CKSELR_UART4SRC)))

/** @brief macro to configure the UART35 clock (UART35CLK).
  *
  * @param  __UART35CLKSource__: specifies the UART35 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_UART35CLKSOURCE_PCLK1: PCLK1 Clock selected as UART35
  *                                            clock (default after reset)
  *            @arg RCC_UART35CLKSOURCE_PLL4:  PLL4_Q Clock selected as UART35 clock
  *            @arg RCC_UART35CLKSOURCE_HSI:   HSI selected as UART35 clock
  *            @arg RCC_UART35CLKSOURCE_CSI:   CSI Clock selected as UART35 clock
  *            @arg RCC_UART35CLKSOURCE_HSE:   HSE selected as UART35 clock
  * @retval None
  */
#define __HAL_RCC_UART35_CONFIG(__UART35CLKSource__) \
  MODIFY_REG(RCC->UART35CKSELR, RCC_UART35CKSELR_UART35SRC, (uint32_t)(__UART35CLKSource__))

/** @brief  macro to get the UART35 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_UART35CLKSOURCE_PCLK1:  PCLK1 Clock selected as UART35 clock
  *            @arg RCC_UART35CLKSOURCE_PLL4:   PLL4_Q Clock selected as UART35 clock
  *            @arg RCC_UART35CLKSOURCE_HSI:    HSI selected as UART35 clock
  *            @arg RCC_UART35CLKSOURCE_CSI:    CSI Clock selected as UART35 clock
  *            @arg RCC_UART35CLKSOURCE_HSE:    HSE selected as UART35 clock
  */
#define __HAL_RCC_GET_UART35_SOURCE() ((uint32_t)(READ_BIT(RCC->UART35CKSELR, RCC_UART35CKSELR_UART35SRC)))


/** @brief macro to configure the USART6 clock (USART6CLK).
  *
  * @param  __USART6CLKSource__: specifies the USART6 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USART6CLKSOURCE_PCLK2: PCLK2 Clock selected as USART6 clock (default after reset)
  *            @arg RCC_USART6CLKSOURCE_PLL4:  PLL4_Q Clock selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_HSI:   HSI selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_CSI:   CSI Clock selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_HSE:   HSE selected as USART6 clock
  * @retval None
  */
#define __HAL_RCC_USART6_CONFIG(__USART6CLKSource__) \
  MODIFY_REG(RCC->UART6CKSELR, RCC_UART6CKSELR_UART6SRC, (uint32_t)(__USART6CLKSource__))

/** @brief  macro to get the USART6 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USART6CLKSOURCE_PCLK2: PCLK2 Clock selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_PLL4:  PLL4_Q Clock selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_HSI:   HSI selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_CSI:   CSI Clock selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_HSE:   HSE selected as USART6 clock
  */
#define __HAL_RCC_GET_USART6_SOURCE() ((uint32_t)(READ_BIT(RCC->UART6CKSELR, RCC_UART6CKSELR_UART6SRC)))

/** @brief macro to configure the UART78clock (UART78CLK).
  *
  * @param  __UART78CLKSource__: specifies the UART78 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_UART78CLKSOURCE_PCLK1: PCLK1 Clock selected as UART78 clock (default after reset)
  *            @arg RCC_UART78CLKSOURCE_PLL4:  PLL4_Q Clock selected as UART78 clock
  *            @arg RCC_UART78CLKSOURCE_HSI:   HSI selected as UART78 clock
  *            @arg RCC_UART78CLKSOURCE_CSI:   CSI Clock selected as UART78 clock
  *            @arg RCC_UART78CLKSOURCE_HSE:   HSE selected as UART78 clock
  * @retval None
  */
#define __HAL_RCC_UART78_CONFIG(__UART78CLKSource__) \
  MODIFY_REG(RCC->UART78CKSELR, RCC_UART78CKSELR_UART78SRC, (uint32_t)(__UART78CLKSource__))

