zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc_ex.h
/** @brief  macro to get the UART78 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_UART78CLKSOURCE_PCLK1: PCLK1 Clock selected as UART78 clock
  *            @arg RCC_UART78CLKSOURCE_PLL4:  PLL4_Q Clock selected as UART78 clock
  *            @arg RCC_UART78CLKSOURCE_HSI:   HSI selected as UART78 clock
  *            @arg RCC_UART78CLKSOURCE_CSI:   CSI Clock selected as UART78 clock
  *            @arg RCC_UART78CLKSOURCE_HSE:   HSE selected as UART78 clock
  */
#define __HAL_RCC_GET_UART78_SOURCE() ((uint32_t)(READ_BIT(RCC->UART78CKSELR, RCC_UART78CKSELR_UART78SRC)))

/** @brief macro to configure the SDMMC1 clock (SDMMC1CLK).
  *
  * @param  __SDMMC12CLKSource__: specifies the SDMMC12 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SDMMC1CLKSOURCE_HCLK6: HCLK6 Clock selected as SDMMC12 clock (default after reset)
  *            @arg RCC_SDMMC1CLKSOURCE_PLL3:  PLL3_R Clock selected as SDMMC12 clock
  *            @arg RCC_SDMMC1CLKSOURCE_PLL4:  PLL4_P selected as SDMMC12 clock
  *            @arg RCC_SDMMC1CLKSOURCE_HSI:   HSI selected as SDMMC12 clock
  * @retval None
  */
#define __HAL_RCC_SDMMC1_CONFIG(__SDMMC12CLKSource__) \
  MODIFY_REG(RCC->SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC1SRC, (uint32_t)(__SDMMC12CLKSource__))

/** @brief  macro to get the SDMMC1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SDMMC1CLKSOURCE_HCLK6: HCLK6 Clock selected as SDMMC12 clock (default after reset)
  *            @arg RCC_SDMMC1CLKSOURCE_PLL3:  PLL3_R Clock selected as SDMMC12 clock
  *            @arg RCC_SDMMC1CLKSOURCE_PLL4:  PLL4_P selected as SDMMC12 clock
  *            @arg RCC_SDMMC1CLKSOURCE_HSI:   HSI selected as SDMMC12 clock
  */
#define __HAL_RCC_GET_SDMMC1_SOURCE() ((uint32_t)(READ_BIT(RCC->SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC1SRC)))

/** @brief macro to configure the SDMMC2 clock (SDMMC2CLK).
  *
  * @param  __SDMMC2CLKSource__: specifies the SDMMC2 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SDMMC2CLKSOURCE_HCLK6: HCLK6 Clock selected as SDMMC2 clock (default after reset)
  *            @arg RCC_SDMMC2CLKSOURCE_PLL3:  PLL3_R Clock selected as SDMMC2 clock
  *            @arg RCC_SDMMC2CLKSOURCE_PLL4:  PLL4_P selected as SDMMC2 clock
  *            @arg RCC_SDMMC2CLKSOURCE_HSI:   HSI selected as SDMMC2 clock
  * @retval None
  */
#define __HAL_RCC_SDMMC2_CONFIG(__SDMMC2CLKSource__) \
  MODIFY_REG(RCC->SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC2SRC, (uint32_t)(__SDMMC2CLKSource__))

/** @brief  macro to get the SDMMC2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SDMMC2CLKSOURCE_HCLK6: HCLK6 Clock selected as SDMMC2 clock (default after reset)
  *            @arg RCC_SDMMC2CLKSOURCE_PLL3:  PLL3_R Clock selected as SDMMC2 clock
  *            @arg RCC_SDMMC2CLKSOURCE_PLL4:  PLL4_P selected as SDMMC2 clock
  *            @arg RCC_SDMMC2CLKSOURCE_HSI:   HSI selected as SDMMC2 clock
  */
#define __HAL_RCC_GET_SDMMC2_SOURCE() ((uint32_t)(READ_BIT(RCC->SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC2SRC)))

/** @brief macro to configure the ETH1 clock (ETH1CLK).
  *
  * @param  __ETH1CLKSource__: specifies the ETH1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_ETH1CLKSOURCE_PLL4:  PLL4_P selected as ETH1 clock (default after reset)
  *            @arg RCC_ETH1CLKSOURCE_PLL3:  PLL3_Q Clock selected as ETH1 clock
  *            @arg RCC_ETH1CLKSOURCE_OFF:   the kernel clock is disabled
  * @retval None
  */
#define __HAL_RCC_ETH1_CONFIG(__ETH1CLKSource__) \
  MODIFY_REG(RCC->ETH12CKSELR, RCC_ETH12CKSELR_ETH1SRC, (uint32_t)(__ETH1CLKSource__))

/** @brief  macro to get the ETH1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ETH1CLKSOURCE_PLL4: PLL4_P selected as ETH1 clock (default after reset)
  *            @arg RCC_ETH1CLKSOURCE_PLL3: PLL3_Q Clock selected as ETH1 clock
  *            @arg RCC_ETH1CLKSOURCE_OFF:  the kernel clock is disabled
  */
#define __HAL_RCC_GET_ETH1_SOURCE() ((uint32_t)(READ_BIT(RCC->ETH12CKSELR, RCC_ETH12CKSELR_ETH1SRC)))

/** @brief macro to configure the ETH2 clock (ETH2CLK).
  *
  * @param  __ETH2CLKSource__: specifies the ETH2 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_ETH2CLKSOURCE_PLL4:  PLL4_P selected as ETH2 clock (default after reset)
  *            @arg RCC_ETH2CLKSOURCE_PLL3:  PLL3_Q Clock selected as ETH2 clock
  *            @arg RCC_ETH2CLKSOURCE_OFF:   the kernel clock is disabled
  * @retval None
  */
#define __HAL_RCC_ETH2_CONFIG(__ETH2CLKSource__) \
  MODIFY_REG(RCC->ETH12CKSELR, RCC_ETH12CKSELR_ETH2SRC, (uint32_t)(__ETH2CLKSource__))

/** @brief  macro to get the ETH2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ETH2CLKSOURCE_PLL4: PLL4_P selected as ETH2 clock (default after reset)
  *            @arg RCC_ETH2CLKSOURCE_PLL3: PLL3_Q Clock selected as ETH2 clock
  *            @arg RCC_ETH2CLKSOURCE_OFF:  the kernel clock is disabled
  */
#define __HAL_RCC_GET_ETH2_SOURCE() ((uint32_t)(READ_BIT(RCC->ETH12CKSELR, RCC_ETH12CKSELR_ETH2SRC)))

/** @brief macro to configure the QSPI clock (QSPICLK).
  *
  * @param  __QSPICLKSource__: specifies the QSPI clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_QSPICLKSOURCE_ACLK:  ACLK Clock selected as QSPI clock (default after reset)
  *            @arg RCC_QSPICLKSOURCE_PLL3:  PLL3_R Clock selected as QSPI clock
  *            @arg RCC_QSPICLKSOURCE_PLL4:  PLL4_P selected as QSPI clock
  *            @arg RCC_QSPICLKSOURCE_PER:   PER selected as QSPI clock
  * @retval None
  */
#define __HAL_RCC_QSPI_CONFIG(__QSPICLKSource__) \
  MODIFY_REG(RCC->QSPICKSELR, RCC_QSPICKSELR_QSPISRC, (uint32_t)(__QSPICLKSource__))

/** @brief  macro to get the QSPI clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_QSPICLKSOURCE_ACLK:  ACLK Clock selected as QSPI clock (default after reset)
  *            @arg RCC_QSPICLKSOURCE_PLL3:  PLL3_R Clock selected as QSPI clock
  *            @arg RCC_QSPICLKSOURCE_PLL4:  PLL4_P selected as QSPI clock
  *            @arg RCC_QSPICLKSOURCE_PER:   PER selected as QSPI clock
  */
#define __HAL_RCC_GET_QSPI_SOURCE() ((uint32_t)(READ_BIT(RCC->QSPICKSELR, RCC_QSPICKSELR_QSPISRC)))


