zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc_ex.h
/** @brief  macro to get the RNG1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_RNG1CLKSOURCE_CSI:   CSI Clock selected as RNG1 clock (default after reset)
  *            @arg RCC_RNG1CLKSOURCE_PLL4:  PLL4_R Clock selected as RNG1 clock
  *            @arg RCC_RNG1CLKSOURCE_LSI:   LSI Clock selected as RNG1 clock
  */
#define __HAL_RCC_GET_RNG1_SOURCE() ((uint32_t)(READ_BIT(RCC->RNG1CKSELR, RCC_RNG1CKSELR_RNG1SRC)))

/** @brief macro to configure the CK_PER clock (CK_PERCLK).
  *
  * @param  __CKPERCLKSource__: specifies the CPER clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_CKPERCLKSOURCE_HSI:   HSI Clock selected as CK_PER clock (default after reset)
  *            @arg RCC_CKPERCLKSOURCE_CSI:   CSI Clock selected as CK_PER clock
  *            @arg RCC_CKPERCLKSOURCE_HSE:   HSE Clock selected as CK_PER clock
  *            @arg RCC_CKPERCLKSOURCE_OFF:   Clock disabled for CK_PER
  * @retval None
  */
#define __HAL_RCC_CKPER_CONFIG(__CKPERCLKSource__) \
  MODIFY_REG(RCC->CPERCKSELR, RCC_CPERCKSELR_CKPERSRC, (uint32_t)(__CKPERCLKSource__))

/** @brief  macro to get the CPER clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_CKPERCLKSOURCE_HSI:   HSI Clock selected as CK_PER clock (default after reset)
  *            @arg RCC_CKPERCLKSOURCE_CSI:   CSI Clock selected as CK_PER clock
  *            @arg RCC_CKPERCLKSOURCE_HSE:   HSE Clock selected as CK_PER clock
  *            @arg RCC_CKPERCLKSOURCE_OFF:   Clock disabled for CK_PER
  */
#define __HAL_RCC_GET_CKPER_SOURCE() ((uint32_t)(READ_BIT(RCC->CPERCKSELR, RCC_CPERCKSELR_CKPERSRC)))


/** @brief macro to configure the STGEN clock (STGENCLK).
  *
  * @param  __STGENCLKSource__: specifies the STGEN clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_STGENCLKSOURCE_HSI:   HSI Clock selected as STGEN clock (default after reset)
  *            @arg RCC_STGENCLKSOURCE_HSE:   HSE Clock selected as STGEN clock
  *            @arg RCC_STGENCLKSOURCE_OFF:   Clock disabled
  *
  * @retval None
  */
#define __HAL_RCC_STGEN_CONFIG(__STGENCLKSource__) \
  MODIFY_REG(RCC->STGENCKSELR, RCC_STGENCKSELR_STGENSRC, (uint32_t)(__STGENCLKSource__))

/** @brief  macro to get the STGEN clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_STGENCLKSOURCE_HSI:   HSI Clock selected as STGEN clock (default after reset)
  *            @arg RCC_STGENCLKSOURCE_HSE:   HSE Clock selected as STGEN clock
  *            @arg RCC_STGENCLKSOURCE_OFF:   Clock disabled
  */
#define __HAL_RCC_GET_STGEN_SOURCE() ((uint32_t)(READ_BIT(RCC->STGENCKSELR, RCC_STGENCKSELR_STGENSRC)))

#if defined(RCC_PERIPHCLK_DCMIPP)
/** @brief macro to configure the DCMIPP clock (DCMIPPCLK).
  *
  * @param  __DCMIPPCLKSource__: specifies the DCMIPP clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_DCMIPPCLKSOURCE_ACLK:  ACLK Clock selected as DCMIPP clock (default after reset)
  *            @arg RCC_DCMIPPCLKSOURCE_PLL2:  PLL2 Clock selected as DCMIPP clock
  *            @arg RCC_DCMIPPCLKSOURCE_PLL4:  PLL4 Clock selected as DCMIPP clock
  *            @arg RCC_DCMIPPCLKSOURCE_PER:   PER Clock selected as DCMIPP clock
  *
  * @retval None
  */
#define __HAL_RCC_DCMIPP_CONFIG(__DCMIPPCLKSource__) \
  MODIFY_REG(RCC->DCMIPPCKSELR, RCC_DCMIPPCKSELR_DCMIPPSRC, (uint32_t)(__DCMIPPCLKSource__))

/** @brief  macro to get the DCMIPP clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_DCMIPPCLKSOURCE_ACLK:  ACLK Clock selected as DCMIPP clock (default after reset)
  *            @arg RCC_DCMIPPCLKSOURCE_PLL2:  PLL2 Clock selected as DCMIPP clock
  *            @arg RCC_DCMIPPCLKSOURCE_PLL4:  PLL4 Clock selected as DCMIPP clock
  *            @arg RCC_DCMIPPCLKSOURCE_PER:   PER Clock selected as DCMIPP clock
  */
#define __HAL_RCC_GET_DCMIPP_SOURCE() ((uint32_t)(READ_BIT(RCC->DCMIPPCKSELR, RCC_DCMIPPCKSELR_DCMIPPSRC)))
#endif /* RCC_PERIPHCLK_DCMIPP */

#if defined(RCC_PERIPHCLK_SAES)
/** @brief macro to configure the SAES clock (SAESCLK).
  *
  * @param  __SAESCLKSource__: specifies the SAES clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SAESCLKSOURCE_ACLK:  ACLK Clock selected as SAES clock (default after reset)
  *            @arg RCC_SAESCLKSOURCE_PER:   PER Clock selected as SAES clock
  *            @arg RCC_SAESCLKSOURCE_PLL4:  PLL4 Clock selected as SAES clock
  *            @arg RCC_SAESCLKSOURCE_LSI:   LSI Clock selected as SAES clock
  *
  * @retval None
  */
#define __HAL_RCC_SAES_CONFIG(__SAESCLKSource__) \
  MODIFY_REG(RCC->SAESCKSELR, RCC_SAESCKSELR_SAESSRC, (uint32_t)(__SAESCLKSource__))

/** @brief  macro to get the SAES clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SAESCLKSOURCE_ACLK:  ACLK Clock selected as SAES clock (default after reset)
  *            @arg RCC_SAESCLKSOURCE_PER:   PER Clock selected as SAES clock
  *            @arg RCC_SAESCLKSOURCE_PLL4:  PLL4 Clock selected as SAES clock
  *            @arg RCC_SAESCLKSOURCE_LSI:   LSI Clock selected as SAES clock
  */
#define __HAL_RCC_GET_SAES_SOURCE() ((uint32_t)(READ_BIT(RCC->SAESCKSELR, RCC_SAESCKSELR_SAESSRC)))
#endif /* RCC_PERIPHCLK_SAES */

/** @brief macro to configure the ADC1 clock (ADC1CLK).
  *
  * @param  __ADC1CLKSource__: specifies the ADC1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_ADC1CLKSOURCE_PLL4:    PLL4_R Clock selected as ADC1 clock (default after reset)
  *            @arg RCC_ADC1CLKSOURCE_PER:     PER Clock selected as ADC1 clock
  *            @arg RCC_ADC1CLKSOURCE_PLL3:    PLL3_Q Clock selected as ADC1 clock
  * @retval None
  */
#define __HAL_RCC_ADC1_CONFIG(__ADC1CLKSource__) \
  MODIFY_REG(RCC->ADC12CKSELR, RCC_ADC12CKSELR_ADC1SRC, (uint32_t)(__ADC1CLKSource__))

