zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_rcc_ex.h
/** @brief  macro to get the ADC1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ADC1CLKSOURCE_PLL4:    PLL4_R Clock selected as ADC1 clock (default after reset)
  *            @arg RCC_ADC1CLKSOURCE_PER:     PER Clock selected as ADC1 clock
  *            @arg RCC_ADC1CLKSOURCE_PLL3:    PLL3_Q Clock selected as ADC1 clock
  */
#define __HAL_RCC_GET_ADC1_SOURCE() ((uint32_t)(READ_BIT(RCC->ADC12CKSELR, RCC_ADC12CKSELR_ADC1SRC)))

/** @brief macro to configure the ADC2 clock (ADC2CLK).
  *
  * @param  __ADC2CLKSource__: specifies the ADC2 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_ADC2CLKSOURCE_PLL4:    PLL4_R Clock selected as ADC2 clock (default after reset)
  *            @arg RCC_ADC2CLKSOURCE_PER:     PER Clock selected as ADC2 clock
  *            @arg RCC_ADC2CLKSOURCE_PLL3:    PLL3_Q Clock selected as ADC2 clock
  * @retval None
  */
#define __HAL_RCC_ADC2_CONFIG(__ADC2CLKSource__) \
  MODIFY_REG(RCC->ADC12CKSELR, RCC_ADC12CKSELR_ADC2SRC, (uint32_t)(__ADC2CLKSource__))

/** @brief  macro to get the ADC2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ADC2CLKSOURCE_PLL4:    PLL4_R Clock selected as ADC2 clock (default after reset)
  *            @arg RCC_ADC2CLKSOURCE_PER:     PER Clock selected as ADC2 clock
  *            @arg RCC_ADC2CLKSOURCE_PLL3:    PLL3_Q Clock selected as ADC2 clock
  */
#define __HAL_RCC_GET_ADC2_SOURCE() ((uint32_t)(READ_BIT(RCC->ADC12CKSELR, RCC_ADC12CKSELR_ADC2SRC)))

/** @brief macro to configure the LPTIM1 clock (LPTIM1CLK).
  *
  * @param  __LPTIM1CLKSource__: specifies the LPTIM1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPTIM1CLKSOURCE_PCLK1:   PCLK1 Clock selected as LPTIM1 clock (default after reset)
  *            @arg RCC_LPTIM1CLKSOURCE_PLL4:    PLL4_P Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_PLL3:    PLL3_Q Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSE:     LSE Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSI:     LSI Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_PER:     PER Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_OFF:     The kernel clock is disabled
  *
  * @retval None
  */
#define __HAL_RCC_LPTIM1_CONFIG(__LPTIM1CLKSource__) \
  MODIFY_REG(RCC->LPTIM1CKSELR, RCC_LPTIM1CKSELR_LPTIM1SRC, (uint32_t)(__LPTIM1CLKSource__))

/** @brief  macro to get the LPTIM1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LPTIM1CLKSOURCE_PCLK1:   PCLK1 Clock selected as LPTIM1 clock (default after reset)
  *            @arg RCC_LPTIM1CLKSOURCE_PLL4:    PLL4_P Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_PLL3:    PLL3_Q Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSE:     LSE Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSI:     LSI Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_PER:     PER Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_OFF:     The kernel clock is disabled
  */
#define __HAL_RCC_GET_LPTIM1_SOURCE() ((uint32_t)(READ_BIT(RCC->LPTIM1CKSELR, RCC_LPTIM1CKSELR_LPTIM1SRC)))

#if defined(RCC_LPTIM23CKSELR_LPTIM23SRC)
/** @brief macro to configure the LPTIM23 clock (LPTIM23CLK).
  *
  * @param  __LPTIM23CLKSource__: specifies the LPTIM23 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPTIM23CLKSOURCE_PCLK3:   PCLK3 Clock selected as LPTIM23 clock (default after reset)
  *            @arg RCC_LPTIM23CLKSOURCE_PLL4:    PLL4_Q Clock selected as LPTIM23 clock
  *            @arg RCC_LPTIM23CLKSOURCE_PER:     PER Clock selected as LPTIM23 clock
  *            @arg RCC_LPTIM23CLKSOURCE_LSE:     LSE Clock selected as LPTIM23 clock
  *            @arg RCC_LPTIM23CLKSOURCE_LSI:     LSI Clock selected as LPTIM23 clock
  *            @arg RCC_LPTIM23CLKSOURCE_OFF:     The kernel clock is disabled
  * @retval None
  */
#define __HAL_RCC_LPTIM23_CONFIG(__LPTIM23CLKSource__) \
  MODIFY_REG(RCC->LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM23SRC, (uint32_t)(__LPTIM23CLKSource__))

/** @brief  macro to get the LPTIM23 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LPTIM23CLKSOURCE_PCLK3:   PCLK3 Clock selected as LPTIM23 clock (default after reset)
  *            @arg RCC_LPTIM23CLKSOURCE_PLL4:    PLL4_Q Clock selected as LPTIM23 clock
  *            @arg RCC_LPTIM23CLKSOURCE_PER:     PER Clock selected as LPTIM23 clock
  *            @arg RCC_LPTIM23CLKSOURCE_LSE:     LSE Clock selected as LPTIM23 clock
  *            @arg RCC_LPTIM23CLKSOURCE_LSI:     LSI Clock selected as LPTIM23 clock
  *            @arg RCC_LPTIM23CLKSOURCE_OFF:     The kernel clock is disabled
  */
#define __HAL_RCC_GET_LPTIM23_SOURCE() ((uint32_t)(READ_BIT(RCC->LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM23SRC)))
#endif /* RCC_LPTIM23CKSELR_LPTIM23SRC */

#if defined(RCC_LPTIM23CKSELR_LPTIM2SRC)
/** @brief macro to configure the LPTIM2 clock (LPTIM2CLK).
  *
  * @param  __LPTIM2CLKSource__: specifies the LPTIM2 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPTIM2CLKSOURCE_PCLK3:   PCLK3 Clock selected as LPTIM2 clock (default after reset)
  *            @arg RCC_LPTIM2CLKSOURCE_PLL4:    PLL4_Q Clock selected as LPTIM2 clock
  *            @arg RCC_LPTIM2CLKSOURCE_PER:     PER Clock selected as LPTIM2 clock
  *            @arg RCC_LPTIM2CLKSOURCE_LSE:     LSE Clock selected as LPTIM2 clock
  *            @arg RCC_LPTIM2CLKSOURCE_LSI:     LSI Clock selected as LPTIM2 clock
  *            @arg RCC_LPTIM2CLKSOURCE_OFF:     The kernel clock is disabled
  * @retval None
  */
#define __HAL_RCC_LPTIM2_CONFIG(__LPTIM2CLKSource__) \
  MODIFY_REG(RCC->LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM2SRC, (uint32_t)(__LPTIM2CLKSource__))

/** @brief  macro to get the LPTIM2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LPTIM2CLKSOURCE_PCLK3:   PCLK3 Clock selected as LPTIM2 clock (default after reset)
  *            @arg RCC_LPTIM2CLKSOURCE_PLL4:    PLL4_Q Clock selected as LPTIM2 clock
  *            @arg RCC_LPTIM2CLKSOURCE_PER:     PER Clock selected as LPTIM2 clock
  *            @arg RCC_LPTIM2CLKSOURCE_LSE:     LSE Clock selected as LPTIM2 clock
  *            @arg RCC_LPTIM2CLKSOURCE_LSI:     LSI Clock selected as LPTIM2 clock
  *            @arg RCC_LPTIM2CLKSOURCE_OFF:     The kernel clock is disabled
  */
#define __HAL_RCC_GET_LPTIM2_SOURCE() ((uint32_t)(READ_BIT(RCC->LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM2SRC)))
#endif /* RCC_LPTIM23CKSELR_LPTIM2SRC */

#if defined(RCC_LPTIM23CKSELR_LPTIM3SRC)
/** @brief macro to configure the LPTIM3 clock (LPTIM3CLK).
  *
  * @param  __LPTIM3CLKSource__: specifies the LPTIM3 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPTIM3CLKSOURCE_PCLK3:   PCLK3 Clock selected as LPTIM3 clock (default after reset)
  *            @arg RCC_LPTIM3CLKSOURCE_PLL4:    PLL4_Q Clock selected as LPTIM3 clock
  *            @arg RCC_LPTIM3CLKSOURCE_PER:     PER Clock selected as LPTIM3 clock
  *            @arg RCC_LPTIM3CLKSOURCE_LSE:     LSE Clock selected as LPTIM3 clock
  *            @arg RCC_LPTIM3CLKSOURCE_LSI:     LSI Clock selected as LPTIM3 clock
  *            @arg RCC_LPTIM3CLKSOURCE_OFF:     The kernel clock is disabled
  * @retval None
  */
#define __HAL_RCC_LPTIM3_CONFIG(__LPTIM3CLKSource__) \
  MODIFY_REG(RCC->LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM3SRC, (uint32_t)(__LPTIM3CLKSource__))

/** @brief  macro to get the LPTIM3 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LPTIM3CLKSOURCE_PCLK3:   PCLK3 Clock selected as LPTIM3 clock (default after reset)
  *            @arg RCC_LPTIM3CLKSOURCE_PLL4:    PLL4_Q Clock selected as LPTIM3 clock
  *            @arg RCC_LPTIM3CLKSOURCE_PER:     PER Clock selected as LPTIM3 clock
  *            @arg RCC_LPTIM3CLKSOURCE_LSE:     LSE Clock selected as LPTIM3 clock
  *            @arg RCC_LPTIM3CLKSOURCE_LSI:     LSI Clock selected as LPTIM3 clock
  *            @arg RCC_LPTIM3CLKSOURCE_OFF:     The kernel clock is disabled
  */
#define __HAL_RCC_GET_LPTIM3_SOURCE() ((uint32_t)(READ_BIT(RCC->LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM3SRC)))
#endif /* RCC_LPTIM23CKSELR_LPTIM3SRC */

/** @brief macro to configure the LPTIM45 clock (LPTIM45CLK).
  *
  * @param  __LPTIM45CLKSource__: specifies the LPTIM45 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPTIM45CLKSOURCE_PCLK3:   PCLK3 Clock selected as LPTIM45 clock (default after reset)
  *            @arg RCC_LPTIM45CLKSOURCE_PLL4:    PLL4_P Clock selected as LPTIM45 clock
  *            @arg RCC_LPTIM45CLKSOURCE_PLL3:    PLL3_Q Clock selected as LPTIM45 clock
  *            @arg RCC_LPTIM45CLKSOURCE_LSE:     LSE Clock selected as LPTIM45 clock
  *            @arg RCC_LPTIM45CLKSOURCE_LSI:     LSI Clock selected as LPTIM45 clock
  *            @arg RCC_LPTIM45CLKSOURCE_PER:     PER Clock selected as LPTIM45 clock
  *            @arg RCC_LPTIM45CLKSOURCE_OFF:     The kernel clock is disabled
  * @retval None
  */
#define __HAL_RCC_LPTIM45_CONFIG(__LPTIM45CLKSource__) \
  MODIFY_REG(RCC->LPTIM45CKSELR, RCC_LPTIM45CKSELR_LPTIM45SRC, (uint32_t)(__LPTIM45CLKSource__))

/** @brief  macro to get the LPTIM45 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LPTIM45CLKSOURCE_PCLK3:   PCLK3 Clock selected as LPTIM45 clock (default after reset)
  *            @arg RCC_LPTIM45CLKSOURCE_PLL4:    PLL4_P Clock selected as LPTIM45 clock
  *            @arg RCC_LPTIM45CLKSOURCE_PLL3:    PLL3_Q Clock selected as LPTIM45 clock
  *            @arg RCC_LPTIM45CLKSOURCE_LSE:     LSE Clock selected as LPTIM45 clock
  *            @arg RCC_LPTIM45CLKSOURCE_LSI:     LSI Clock selected as LPTIM45 clock
  *            @arg RCC_LPTIM45CLKSOURCE_PER:     PER Clock selected as LPTIM45 clock
  *            @arg RCC_LPTIM45CLKSOURCE_OFF:     The kernel clock is disabled
  */
#define __HAL_RCC_GET_LPTIM45_SOURCE() ((uint32_t)(READ_BIT(RCC->LPTIM45CKSELR, RCC_LPTIM45CKSELR_LPTIM45SRC)))


/**
  * @brief  Macro to set the APB1 timer clock prescaler
  * @note   Set and reset by software to control the clock frequency of all the timers connected to APB1 domain.
  *         It concerns TIM2, TIM3, TIM4, TIM5, TIM6, TIM7.
  * @param  __RCC_TIMG1PRES__: specifies the Timers clocks prescaler selection
  *          This parameter can be one of the following values:
  *              @arg RCC_TIMG1PRES_DEACTIVATED:  The Timers kernel clock is equal to ck_hclk
  *                                               if APB1DIV is corresponding
  *                                               to a division by 1 or 2, else it is equal to
  *                                               2 x Fck_pclk1 (default after reset)
  *              @arg RCC_TIMG1PRES_ACTIVATED:    The Timers kernel clock is equal to ck_hclk
  *                                               if APB1DIV is corresponding
  *                                               to division by 1, 2 or 4, else it is equal to 4 x Fck_pclk1
  */
#define __HAL_RCC_TIMG1PRES(__RCC_TIMG1PRES__) \
  do{  MODIFY_REG( RCC->TIMG1PRER, RCC_TIMG1PRER_TIMG1PRE , __RCC_TIMG1PRES__ );\
  } while(0)

/** @brief  Macro to get the APB1 timer clock prescaler.
  * @retval The APB1 timer clock prescaler. The returned value can be one
  *         of the following:
  *             - RCC_TIMG1PRES_DEACTIVATED: The Timers kernel clock is equal to ck_hclk if APB1DIV is corresponding
  *                                           to a division by 1 or 2, else it is equal to 2 x Fck_pclk1
  *                                           (default after reset)
  *             - RCC_TIMG1PRES_ACTIVATED:   The Timers kernel clock is equal to ck_hclk if APB1DIV is corresponding
  *                                          to division by 1, 2 or 4, else it is equal to 4 x Fck_pclk1
  */
#define __HAL_RCC_GET_TIMG1PRES() ((uint32_t)(RCC->TIMG1PRER & RCC_TIMG1PRER_TIMG1PRE))

/**
  * @brief  Macro to set the APB2 timers clocks prescaler
  * @note   Set and reset by software to control the clock frequency of all the timers connected to APB2 domain.
  *         It concerns TIM1 and TIM8.
  * @param  __RCC_TIMG2PRES__: specifies the timers clocks prescaler selection
  *          This parameter can be one of the following values:
  *              @arg RCC_TIMG2PRES_DEACTIVATED:  The Timers kernel clock is equal to ck_hclk if
  *                                               APB2DIV is corresponding to a division by 1 or 2, else
  *                                               it is equal to 2 x Fck_pclk2 (default after reset)
  *              @arg RCC_TIMG2PRES_ACTIVATED:    The Timers kernel clock is equal to ck_hclk if APB2DIV is
  *                                               correspondingto division by 1, 2 or 4, else
  *                                               it is equal to 4 x Fck_pclk1
  */
#define __HAL_RCC_TIMG2PRES(__RCC_TIMG2PRES__) \
  do{  MODIFY_REG( RCC->TIMG2PRER, RCC_TIMG2PRER_TIMG2PRE , __RCC_TIMG2PRES__ );\
  } while(0)

/** @brief  Macro to get the APB2 timer clock prescaler.
  * @retval The APB2 timer clock prescaler. The returned value can be one
  *         of the following:
  *             - RCC_TIMG2PRES_DEACTIVATED: The Timers kernel clock is equal to ck_hclk if APB2DIV is corresponding
  *                                           to a division by 1 or 2, else it is equal to
  *                                           2 x Fck_pclk1 (default after reset)
  *             - RCC_TIMG2PRES_ACTIVATED:   The Timers kernel clock is equal to ck_hclk if APB2DIV is corresponding
  *                                          to division by 1, 2 or 4, else it is equal to 4 x Fck_pclk1
  */
#define __HAL_RCC_GET_TIMG2PRES() ((uint32_t)(RCC->TIMG2PRER & RCC_TIMG2PRER_TIMG2PRE))

/**
  * @brief  Macro to set the APB6 timers clocks prescaler
  * @note   Set and reset by software to control the clock frequency of all the timers connected to APB6 domain.
  *         It concerns TIM12, TIM13, TIM14, TIM15, TIM16, and TIM17.
  * @param  __RCC_TIMG3PRES__: specifies the timers clocks prescaler selection
  *          This parameter can be one of the following values:
  *              @arg RCC_TIMG3PRES_DEACTIVATED:  The Timers kernel clock is equal to ck_hclk if
  *                                               APB6DIV is corresponding to a division by 1 or 2, else
  *                                               it is equal to 2 x Fck_pclk2 (default after reset)
  *              @arg RCC_TIMG3PRES_ACTIVATED:    The Timers kernel clock is equal to ck_hclk if APB6DIV is
  *                                               correspondingto division by 1, 2 or 4, else
  *                                               it is equal to 4 x Fck_pclk1
  */
#define __HAL_RCC_TIMG3PRES(__RCC_TIMG3PRES__) \
  do{  MODIFY_REG( RCC->TIMG3PRER, RCC_TIMG3PRER_TIMG3PRE , __RCC_TIMG3PRES__ );\
  } while(0)

